package com.zhanghao.skinexpert.beans;

import java.util.List;

/**
 * Created by 黑曼巴ye on 2016/12/23.
 */

public class DetailAllDisgussBean {

    /**
     * error_code : 0
     * message : 成功
     * data : {"list":[{"id":157735,"tags":[],"content":"一个都快用完了，然而并没卵用。。。痘痘还在长啊","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-20 10:11:21","sortID":"48159","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaGiadF08Oubg1BvKONTWibjA0EHn7gHEXdujInEjIOxXFG4jAR2nErmVia2wH1kzmyQI1ib6zsQnHqk9VQsDkscy6vD/0","nick":"葛利娟","uid":386756,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157691,"tags":[],"content":"客服没人理，给了钱不发货，退款没人处理，垃圾APP,大家不要上当了！😡","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-15 13:46:54","sortID":"48105","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/ajNVdqHZLLDyjOarCOUMa7A9bJG5I6v5bfiaNt8Vxjwmrca9VZ0BWZKXyx03SISyNrI7Frc46rOAicibQpyUd8Aqw/0","nick":"妄斷彌空","uid":355043,"userType":"user","skinText":"轻油·重敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157678,"tags":[],"content":"额，请问可以当乳液用吗？","categoryType":"product","image":[],"likedCount":1,"commentCount":1,"createTime":"2016-12-13 22:12:15","sortID":"48087","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"不可以，涂了很干燥","userType":"user"}],"user":{"headface":"http://img.ilikelabs.com/Uploads/214/214341_0-440-440.jpg","nick":"梨汝","uid":341839,"userType":"user","skinText":"轻油·重耐·非色素·紧致"},"product":[],"subscribed":false},{"id":157661,"tags":[],"content":"大概几天发货啊？客服怎么不理我","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-12 09:02:44","sortID":"48068","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaEvibibfj0OdRDOeL3CAEEJ4ISSx5cXwmc8NPQn6v9ClddIM1Swd63xodWgMVUPph6rR4KBibhf05ia8A/0","nick":"胡慢慢吧","uid":378838,"userType":"user","skinText":"轻干·轻敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157434,"tags":[],"content":"同问 怎么买","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-05 19:41:05","sortID":"47830","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/FZbe40rMUVjJL0P8nH5XerR6PMU86Q7ibneGoWfj814e0T3uuTkxVLLXnntxzHpLHBJ6NBhepqSMoic6Ucynh2kdsXUQLe77Wib/0","nick":"爱简单但相信太难","uid":383589,"userType":"user","skinText":"轻干·轻敏·非色素·紧致"},"product":[],"subscribed":false},{"id":157398,"tags":[],"content":"居然淘宝找不到 🌝","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-12-02 23:35:29","sortID":"47792","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/FZbe40rMUVhzuX9QibLL1ibASSaPeukM7Nv82aZOjBibOicCDn8qDnCbswtGbcnjqwyxQVngsibLZmQgOibvlCClr7cicWdMx7k9HjW/0","nick":"O.LIVI","uid":364300,"userType":"user","skinText":"轻油·重敏·非色素·紧致"},"product":[],"subscribed":false},{"id":157397,"tags":[],"content":"真的好用吗？实话","categoryType":"product","image":[],"likedCount":0,"commentCount":2,"createTime":"2016-12-02 22:59:11","sortID":"47791","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"没什么效果，真的","userType":"user"},{"nick":"橡皮泥娃娃","onick":"","content":"好用","userType":"user"}],"user":{"headface":"http://tva1.sinaimg.cn/crop.0.0.664.664.50/006c0xK6jw8f6fwfaz871j30ig0igjsf.jpg","nick":"芮女啦","uid":379537,"userType":"user","skinText":"重油·重耐·非色素·紧致"},"product":[],"subscribed":false},{"id":157349,"tags":[],"content":"我想用美肤家买东西，怎么买的？？","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-30 13:13:54","sortID":"47740","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/rK4iaib8uYt1W6pJU8TEjd1tzIMZXSicILvicmQmNFPiasqGKcbhKfUWmrvnicPnOZcLxwN91ibDq3jqIKoeQ4UpJKepxJYgwVp4Dlc/0","nick":"忆时","uid":325435,"userType":"user","skinText":"轻油·轻敏·非色素·紧致"},"product":[],"subscribed":false},{"id":157302,"tags":[],"content":"在哪买啊？？？急","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-26 17:22:11","sortID":"47684","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://tva3.sinaimg.cn/crop.0.0.996.996.50/005BGYUBjw8f9gaybcvulj30ro0roaap.jpg","nick":"YUN嚴","uid":370477,"userType":"user","skinText":"轻油·轻耐·非色素·皱纹"},"product":[],"subscribed":false},{"id":157284,"tags":[],"content":"在哪买啊","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-11-24 21:28:20","sortID":"47659","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/XCopLcwfzedp88yCFE9Nr4R8H4J6MfcEibh23ric3Uxx3hicjXibzrejTKShOyeczztyiatAB4Yibob45o7TXNoyVd2HzKdCMd3mibJ/0","nick":"Moster","uid":366125,"userType":"user","skinText":"重油·轻敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157273,"tags":[],"content":"为什么买不了啊？","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-23 20:19:33","sortID":"47648","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://img.ilikelabs.com/Uploads/140/140130_0-180-180","nick":"wy","uid":375506,"userType":"user","skinText":"重油·重耐·非色素·紧致"},"product":[],"subscribed":false},{"id":157199,"tags":[],"content":"这在哪买呢","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-11-18 15:10:10","sortID":"47565","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://tp2.sinaimg.cn/2233290633/180/5605059092/0","nick":"情情情情情儿","uid":247607,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157156,"tags":[],"content":"请问\u201c美肤家清痘净颜精华露\u201d在哪里能买到？","categoryType":"product","image":[],"likedCount":3,"commentCount":0,"createTime":"2016-11-16 00:07:50","sortID":"47519","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/dwPBeb42grIqlpjqTpe9tia8DWPVNGictiahOI3CMiaYB32EgGkILTEQs5xibvpTcfG7ecQxBuBnPmh6Oau3GOQW8DOOHRW5ytqGN/0","nick":"橘子君","uid":340951,"userType":"user","skinText":"轻油·重敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157073,"tags":[],"content":"真的有用吗，可以祛痘印吗😊","categoryType":"product","image":[],"likedCount":2,"commentCount":1,"createTime":"2016-11-12 18:51:10","sortID":"47422","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"不可以去痘印对痘痘也不怎么有效果","userType":"user"}],"user":{"headface":"http://tva2.sinaimg.cn/crop.0.0.996.996.50/0069MJzJjw8f71av8m7duj30ro0rognj.jpg","nick":"易人light","uid":374455,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157055,"tags":[],"content":"咋买","categoryType":"product","image":[],"likedCount":3,"commentCount":0,"createTime":"2016-11-10 18:16:58","sortID":"47402","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/ajNVdqHZLLAuBgnPkTibLBaH4nwUFIXpiaWvKvSuTCnf6cJGibI9kZqgaNC4wm7RVKrgsJWM3btF3BxDVeZOjRtKg/0","nick":"樊志尧","uid":317417,"userType":"user","skinText":"轻干·重耐·非色素·皱纹"},"product":[],"subscribed":false},{"id":157013,"tags":[],"content":"请问孕妇可以用吗？怀孕七个月脸上长了很多痘痘","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-08 12:23:54","sortID":"47357","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/XCopLcwfzecPyOpHIVW0agOfckv2I1Heo210l8ceVNxX3nZED31UcyGQOM8QuYLtWJ5B6mMr3YXrBcicoZ9dpmQ/0","nick":"二当家","uid":78087,"userType":"user","skinText":"轻油·重敏·非色素·紧致"},"product":[],"subscribed":false},{"id":157004,"tags":[],"content":"怎么不好买","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-07 20:38:52","sortID":"47348","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://img.ilikelabs.com/Uploads/165/165589_0-320-320.jpg","nick":"功夫兔","uid":126122,"userType":"user","skinText":"轻油·轻耐·非色素·皱纹"},"product":[],"subscribed":false},{"id":156987,"tags":[],"content":"我就想知道怎么买","categoryType":"product","image":[],"likedCount":2,"commentCount":2,"createTime":"2016-11-06 16:15:03","sortID":"47331","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"zii","onick":"","content":"微店有链接吗？","userType":"user"},{"nick":"小舟Myra","onick":"","content":"这个是在美肤家微店卖的","userType":"user"}],"user":{"headface":"http://img.ilikelabs.com/Uploads/140/140130_0-180-180","nick":"MFJ65087","uid":371367,"userType":"user","skinText":"轻干·重敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":156921,"tags":[],"content":"我也想买啊，脸都快毁了，痛苦啊","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-03 20:24:26","sortID":"47235","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/rK4iaib8uYt1XvcPeialckOsTlo8BTCtibBEgy41W5e7F2UibicEGGTJ4JrHPUP1ia3UcU4sNGuYjzbEshYG1qBr5PbTCAQO5NQpPnn/0","nick":"无根的浮萍","uid":369611,"userType":"user","skinText":"重油·重敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":156855,"tags":[],"content":"我怎么买不了","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-10-31 09:33:15","sortID":"47151","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/Q3auHgzwzM7COI8Aaqjwnol2ly9lEic1473zcQmJnWl18tZejqibMOHzBPSKefMjB0AtibYE2jiaVf0b1tP3ZqViaiatsnWwwQFSqXC8ro2A76O88/0","nick":"文","uid":364854,"userType":"user","skinText":"轻油·轻耐·非色素·紧致"},"product":[],"subscribed":false}],"isAttention":false,"totalCount":14,"attentionCount":2,"activeTitle":"","rid":0,"description":"","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","user":{"uid":0,"nick":"","headface":""}}
     */

    private int error_code;
    private String message;
    private DataBean data;

    public int getError_code() {
        return error_code;
    }

    public void setError_code(int error_code) {
        this.error_code = error_code;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * list : [{"id":157735,"tags":[],"content":"一个都快用完了，然而并没卵用。。。痘痘还在长啊","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-20 10:11:21","sortID":"48159","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaGiadF08Oubg1BvKONTWibjA0EHn7gHEXdujInEjIOxXFG4jAR2nErmVia2wH1kzmyQI1ib6zsQnHqk9VQsDkscy6vD/0","nick":"葛利娟","uid":386756,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157691,"tags":[],"content":"客服没人理，给了钱不发货，退款没人处理，垃圾APP,大家不要上当了！😡","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-15 13:46:54","sortID":"48105","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/ajNVdqHZLLDyjOarCOUMa7A9bJG5I6v5bfiaNt8Vxjwmrca9VZ0BWZKXyx03SISyNrI7Frc46rOAicibQpyUd8Aqw/0","nick":"妄斷彌空","uid":355043,"userType":"user","skinText":"轻油·重敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157678,"tags":[],"content":"额，请问可以当乳液用吗？","categoryType":"product","image":[],"likedCount":1,"commentCount":1,"createTime":"2016-12-13 22:12:15","sortID":"48087","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"不可以，涂了很干燥","userType":"user"}],"user":{"headface":"http://img.ilikelabs.com/Uploads/214/214341_0-440-440.jpg","nick":"梨汝","uid":341839,"userType":"user","skinText":"轻油·重耐·非色素·紧致"},"product":[],"subscribed":false},{"id":157661,"tags":[],"content":"大概几天发货啊？客服怎么不理我","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-12 09:02:44","sortID":"48068","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaEvibibfj0OdRDOeL3CAEEJ4ISSx5cXwmc8NPQn6v9ClddIM1Swd63xodWgMVUPph6rR4KBibhf05ia8A/0","nick":"胡慢慢吧","uid":378838,"userType":"user","skinText":"轻干·轻敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157434,"tags":[],"content":"同问 怎么买","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-05 19:41:05","sortID":"47830","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/FZbe40rMUVjJL0P8nH5XerR6PMU86Q7ibneGoWfj814e0T3uuTkxVLLXnntxzHpLHBJ6NBhepqSMoic6Ucynh2kdsXUQLe77Wib/0","nick":"爱简单但相信太难","uid":383589,"userType":"user","skinText":"轻干·轻敏·非色素·紧致"},"product":[],"subscribed":false},{"id":157398,"tags":[],"content":"居然淘宝找不到 🌝","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-12-02 23:35:29","sortID":"47792","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/FZbe40rMUVhzuX9QibLL1ibASSaPeukM7Nv82aZOjBibOicCDn8qDnCbswtGbcnjqwyxQVngsibLZmQgOibvlCClr7cicWdMx7k9HjW/0","nick":"O.LIVI","uid":364300,"userType":"user","skinText":"轻油·重敏·非色素·紧致"},"product":[],"subscribed":false},{"id":157397,"tags":[],"content":"真的好用吗？实话","categoryType":"product","image":[],"likedCount":0,"commentCount":2,"createTime":"2016-12-02 22:59:11","sortID":"47791","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"没什么效果，真的","userType":"user"},{"nick":"橡皮泥娃娃","onick":"","content":"好用","userType":"user"}],"user":{"headface":"http://tva1.sinaimg.cn/crop.0.0.664.664.50/006c0xK6jw8f6fwfaz871j30ig0igjsf.jpg","nick":"芮女啦","uid":379537,"userType":"user","skinText":"重油·重耐·非色素·紧致"},"product":[],"subscribed":false},{"id":157349,"tags":[],"content":"我想用美肤家买东西，怎么买的？？","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-30 13:13:54","sortID":"47740","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/rK4iaib8uYt1W6pJU8TEjd1tzIMZXSicILvicmQmNFPiasqGKcbhKfUWmrvnicPnOZcLxwN91ibDq3jqIKoeQ4UpJKepxJYgwVp4Dlc/0","nick":"忆时","uid":325435,"userType":"user","skinText":"轻油·轻敏·非色素·紧致"},"product":[],"subscribed":false},{"id":157302,"tags":[],"content":"在哪买啊？？？急","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-26 17:22:11","sortID":"47684","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://tva3.sinaimg.cn/crop.0.0.996.996.50/005BGYUBjw8f9gaybcvulj30ro0roaap.jpg","nick":"YUN嚴","uid":370477,"userType":"user","skinText":"轻油·轻耐·非色素·皱纹"},"product":[],"subscribed":false},{"id":157284,"tags":[],"content":"在哪买啊","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-11-24 21:28:20","sortID":"47659","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/XCopLcwfzedp88yCFE9Nr4R8H4J6MfcEibh23ric3Uxx3hicjXibzrejTKShOyeczztyiatAB4Yibob45o7TXNoyVd2HzKdCMd3mibJ/0","nick":"Moster","uid":366125,"userType":"user","skinText":"重油·轻敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157273,"tags":[],"content":"为什么买不了啊？","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-23 20:19:33","sortID":"47648","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://img.ilikelabs.com/Uploads/140/140130_0-180-180","nick":"wy","uid":375506,"userType":"user","skinText":"重油·重耐·非色素·紧致"},"product":[],"subscribed":false},{"id":157199,"tags":[],"content":"这在哪买呢","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-11-18 15:10:10","sortID":"47565","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://tp2.sinaimg.cn/2233290633/180/5605059092/0","nick":"情情情情情儿","uid":247607,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157156,"tags":[],"content":"请问\u201c美肤家清痘净颜精华露\u201d在哪里能买到？","categoryType":"product","image":[],"likedCount":3,"commentCount":0,"createTime":"2016-11-16 00:07:50","sortID":"47519","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/dwPBeb42grIqlpjqTpe9tia8DWPVNGictiahOI3CMiaYB32EgGkILTEQs5xibvpTcfG7ecQxBuBnPmh6Oau3GOQW8DOOHRW5ytqGN/0","nick":"橘子君","uid":340951,"userType":"user","skinText":"轻油·重敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157073,"tags":[],"content":"真的有用吗，可以祛痘印吗😊","categoryType":"product","image":[],"likedCount":2,"commentCount":1,"createTime":"2016-11-12 18:51:10","sortID":"47422","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"不可以去痘印对痘痘也不怎么有效果","userType":"user"}],"user":{"headface":"http://tva2.sinaimg.cn/crop.0.0.996.996.50/0069MJzJjw8f71av8m7duj30ro0rognj.jpg","nick":"易人light","uid":374455,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":157055,"tags":[],"content":"咋买","categoryType":"product","image":[],"likedCount":3,"commentCount":0,"createTime":"2016-11-10 18:16:58","sortID":"47402","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/ajNVdqHZLLAuBgnPkTibLBaH4nwUFIXpiaWvKvSuTCnf6cJGibI9kZqgaNC4wm7RVKrgsJWM3btF3BxDVeZOjRtKg/0","nick":"樊志尧","uid":317417,"userType":"user","skinText":"轻干·重耐·非色素·皱纹"},"product":[],"subscribed":false},{"id":157013,"tags":[],"content":"请问孕妇可以用吗？怀孕七个月脸上长了很多痘痘","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-08 12:23:54","sortID":"47357","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/XCopLcwfzecPyOpHIVW0agOfckv2I1Heo210l8ceVNxX3nZED31UcyGQOM8QuYLtWJ5B6mMr3YXrBcicoZ9dpmQ/0","nick":"二当家","uid":78087,"userType":"user","skinText":"轻油·重敏·非色素·紧致"},"product":[],"subscribed":false},{"id":157004,"tags":[],"content":"怎么不好买","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-07 20:38:52","sortID":"47348","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://img.ilikelabs.com/Uploads/165/165589_0-320-320.jpg","nick":"功夫兔","uid":126122,"userType":"user","skinText":"轻油·轻耐·非色素·皱纹"},"product":[],"subscribed":false},{"id":156987,"tags":[],"content":"我就想知道怎么买","categoryType":"product","image":[],"likedCount":2,"commentCount":2,"createTime":"2016-11-06 16:15:03","sortID":"47331","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"zii","onick":"","content":"微店有链接吗？","userType":"user"},{"nick":"小舟Myra","onick":"","content":"这个是在美肤家微店卖的","userType":"user"}],"user":{"headface":"http://img.ilikelabs.com/Uploads/140/140130_0-180-180","nick":"MFJ65087","uid":371367,"userType":"user","skinText":"轻干·重敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":156921,"tags":[],"content":"我也想买啊，脸都快毁了，痛苦啊","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-03 20:24:26","sortID":"47235","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/rK4iaib8uYt1XvcPeialckOsTlo8BTCtibBEgy41W5e7F2UibicEGGTJ4JrHPUP1ia3UcU4sNGuYjzbEshYG1qBr5PbTCAQO5NQpPnn/0","nick":"无根的浮萍","uid":369611,"userType":"user","skinText":"重油·重敏·非色素·皱纹"},"product":[],"subscribed":false},{"id":156855,"tags":[],"content":"我怎么买不了","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-10-31 09:33:15","sortID":"47151","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/Q3auHgzwzM7COI8Aaqjwnol2ly9lEic1473zcQmJnWl18tZejqibMOHzBPSKefMjB0AtibYE2jiaVf0b1tP3ZqViaiatsnWwwQFSqXC8ro2A76O88/0","nick":"文","uid":364854,"userType":"user","skinText":"轻油·轻耐·非色素·紧致"},"product":[],"subscribed":false}]
         * isAttention : false
         * totalCount : 14
         * attentionCount : 2
         * activeTitle :
         * rid : 0
         * description :
         * categoryImage : http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg
         * user : {"uid":0,"nick":"","headface":""}
         */

        private boolean isAttention;
        private int totalCount;
        private int attentionCount;
        private String activeTitle;
        private int rid;
        private String description;
        private String categoryImage;
        private UserBean user;
        private List<ListBean> list;

        public boolean isIsAttention() {
            return isAttention;
        }

        public void setIsAttention(boolean isAttention) {
            this.isAttention = isAttention;
        }

        public int getTotalCount() {
            return totalCount;
        }

        public void setTotalCount(int totalCount) {
            this.totalCount = totalCount;
        }

        public int getAttentionCount() {
            return attentionCount;
        }

        public void setAttentionCount(int attentionCount) {
            this.attentionCount = attentionCount;
        }

        public String getActiveTitle() {
            return activeTitle;
        }

        public void setActiveTitle(String activeTitle) {
            this.activeTitle = activeTitle;
        }

        public int getRid() {
            return rid;
        }

        public void setRid(int rid) {
            this.rid = rid;
        }

        public String getDescription() {
            return description;
        }

        public void setDescription(String description) {
            this.description = description;
        }

        public String getCategoryImage() {
            return categoryImage;
        }

        public void setCategoryImage(String categoryImage) {
            this.categoryImage = categoryImage;
        }

        public UserBean getUser() {
            return user;
        }

        public void setUser(UserBean user) {
            this.user = user;
        }

        public List<ListBean> getList() {
            return list;
        }

        public void setList(List<ListBean> list) {
            this.list = list;
        }

        public static class UserBean {
            /**
             * uid : 0
             * nick :
             * headface :
             */

            private int uid;
            private String nick;
            private String headface;

            public int getUid() {
                return uid;
            }

            public void setUid(int uid) {
                this.uid = uid;
            }

            public String getNick() {
                return nick;
            }

            public void setNick(String nick) {
                this.nick = nick;
            }

            public String getHeadface() {
                return headface;
            }

            public void setHeadface(String headface) {
                this.headface = headface;
            }
        }

        public static class ListBean {
            /**
             * id : 157735
             * tags : []
             * content : 一个都快用完了，然而并没卵用。。。痘痘还在长啊
             * categoryType : product
             * image : []
             * likedCount : 0
             * commentCount : 0
             * createTime : 2016-12-20 10:11:21
             * sortID : 48159
             * categoryName : 美肤家清痘净颜精华露
             * categoryImage : http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg
             * cmcid : 172184
             * liked : false
             * tags_product : [{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}]
             * comments : []
             * user : {"headface":"http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaGiadF08Oubg1BvKONTWibjA0EHn7gHEXdujInEjIOxXFG4jAR2nErmVia2wH1kzmyQI1ib6zsQnHqk9VQsDkscy6vD/0","nick":"葛利娟","uid":386756,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹"}
             * product : []
             * subscribed : false
             */

            private int id;
            private String content;
            private String categoryType;
            private int likedCount;
            private int commentCount;
            private String createTime;
            private String sortID;
            private String categoryName;
            private String categoryImage;
            private int cmcid;
            private boolean liked;
            private UserBeanX user;
            private boolean subscribed;
            private List<?> tags;
            private List<?> image;
            private List<TagsProductBean> tags_product;
            private List<CommentBean> comments;
            private List<?> product;

           public static class CommentBean{
                private String nick;
                private String onick;
                private String content;
                private String userType;

                public String getNick() {
                    return nick;
                }

                public void setNick(String nick) {
                    this.nick = nick;
                }

                public String getOnick() {
                    return onick;
                }

                public void setOnick(String onick) {
                    this.onick = onick;
                }

                public String getContent() {
                    return content;
                }

                public void setContent(String content) {
                    this.content = content;
                }

                public String getUserType() {
                    return userType;
                }

                public void setUserType(String userType) {
                    this.userType = userType;
                }
            }
            public int getId() {
                return id;
            }

            public void setId(int id) {
                this.id = id;
            }

            public String getContent() {
                return content;
            }

            public void setContent(String content) {
                this.content = content;
            }

            public String getCategoryType() {
                return categoryType;
            }

            public void setCategoryType(String categoryType) {
                this.categoryType = categoryType;
            }

            public int getLikedCount() {
                return likedCount;
            }

            public void setLikedCount(int likedCount) {
                this.likedCount = likedCount;
            }

            public int getCommentCount() {
                return commentCount;
            }

            public void setCommentCount(int commentCount) {
                this.commentCount = commentCount;
            }

            public String getCreateTime() {
                return createTime;
            }

            public void setCreateTime(String createTime) {
                this.createTime = createTime;
            }

            public String getSortID() {
                return sortID;
            }

            public void setSortID(String sortID) {
                this.sortID = sortID;
            }

            public String getCategoryName() {
                return categoryName;
            }

            public void setCategoryName(String categoryName) {
                this.categoryName = categoryName;
            }

            public String getCategoryImage() {
                return categoryImage;
            }

            public void setCategoryImage(String categoryImage) {
                this.categoryImage = categoryImage;
            }

            public int getCmcid() {
                return cmcid;
            }

            public void setCmcid(int cmcid) {
                this.cmcid = cmcid;
            }

            public boolean isLiked() {
                return liked;
            }

            public void setLiked(boolean liked) {
                this.liked = liked;
            }

            public UserBeanX getUser() {
                return user;
            }

            public void setUser(UserBeanX user) {
                this.user = user;
            }

            public boolean isSubscribed() {
                return subscribed;
            }

            public void setSubscribed(boolean subscribed) {
                this.subscribed = subscribed;
            }

            public List<?> getTags() {
                return tags;
            }

            public void setTags(List<?> tags) {
                this.tags = tags;
            }

            public List<?> getImage() {
                return image;
            }

            public void setImage(List<?> image) {
                this.image = image;
            }

            public List<TagsProductBean> getTags_product() {
                return tags_product;
            }

            public void setTags_product(List<TagsProductBean> tags_product) {
                this.tags_product = tags_product;
            }

            public List<CommentBean> getComments() {
                return comments;
            }

            public void setComments(List<CommentBean> comments) {
                this.comments = comments;
            }

            public List<?> getProduct() {
                return product;
            }

            public void setProduct(List<?> product) {
                this.product = product;
            }

            public static class UserBeanX {
                /**
                 * headface : http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaGiadF08Oubg1BvKONTWibjA0EHn7gHEXdujInEjIOxXFG4jAR2nErmVia2wH1kzmyQI1ib6zsQnHqk9VQsDkscy6vD/0
                 * nick : 葛利娟
                 * uid : 386756
                 * userType : user
                 * skinText : 轻油·轻敏·非色素·皱纹
                 */

                private String headface;
                private String nick;
                private int uid;
                private String userType;
                private String skinText;

                public String getHeadface() {
                    return headface;
                }

                public void setHeadface(String headface) {
                    this.headface = headface;
                }

                public String getNick() {
                    return nick;
                }

                public void setNick(String nick) {
                    this.nick = nick;
                }

                public int getUid() {
                    return uid;
                }

                public void setUid(int uid) {
                    this.uid = uid;
                }

                public String getUserType() {
                    return userType;
                }

                public void setUserType(String userType) {
                    this.userType = userType;
                }

                public String getSkinText() {
                    return skinText;
                }

                public void setSkinText(String skinText) {
                    this.skinText = skinText;
                }
            }

            public static class TagsProductBean {
                /**
                 * tag_id : 172184
                 * image : http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg
                 * name : 美肤家清痘净颜精华露
                 * type : 1
                 * objectId : 2930886
                 * suitableSkin : ["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]
                 * recommendSkin : ["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]
                 */

                private int tag_id;
                private String image;
                private String name;
                private int type;
                private int objectId;
                private List<String> suitableSkin;
                private List<String> recommendSkin;

                public int getTag_id() {
                    return tag_id;
                }

                public void setTag_id(int tag_id) {
                    this.tag_id = tag_id;
                }

                public String getImage() {
                    return image;
                }

                public void setImage(String image) {
                    this.image = image;
                }

                public String getName() {
                    return name;
                }

                public void setName(String name) {
                    this.name = name;
                }

                public int getType() {
                    return type;
                }

                public void setType(int type) {
                    this.type = type;
                }

                public int getObjectId() {
                    return objectId;
                }

                public void setObjectId(int objectId) {
                    this.objectId = objectId;
                }

                public List<String> getSuitableSkin() {
                    return suitableSkin;
                }

                public void setSuitableSkin(List<String> suitableSkin) {
                    this.suitableSkin = suitableSkin;
                }

                public List<String> getRecommendSkin() {
                    return recommendSkin;
                }

                public void setRecommendSkin(List<String> recommendSkin) {
                    this.recommendSkin = recommendSkin;
                }
            }
        }
    }
}
