package com.zhanghao.skinexpert.beans;

import java.util.List;

/**
 * Created by zhanghao on 2016/12/23.
 */

public class ProductMoreBean {

    /**
     * error_code : 0
     * message : 成功
     * data : {"list":[{"cmcid":187915,"threadCount":0,"id":2946604,"name":"焕采无瑕精华乳","title":"修丽可焕采无瑕精华乳","func":"美白淡斑,保湿","price":"780.00","pic":"http://img.ilikelabs.com//Uploads/218/218524_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":4,"security":-1,"brand":"5621","activeTime":"2016-12-20 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","1000","1003","1030","1033","1100","1103","1130","1133","2000","2003","2030","2033","2100","2103","2130","2133","3000","3003","3030","3033","3100","3103","3130","3133"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。修丽可焕采无瑕精华乳是一款美白祛斑产品，产品的保湿成分有多元醇、合成酯、硅油等，保湿性好，质地不厚重。含多种美白成分，并且每个美白成分都从不同层面帮助抗击黑色素：1.水杨酸0.3%：促进角质剥脱，可加快色斑部位的角质更新速度。2.鞣花酸0.5%：可抑制酪氨酸酶活性，从源头抑制黑色素生成，从而美白祛斑。3.具有美白作用的植物成分：向日葵籽提取物+光果甘草根提取物+杏叶提取物。厂家宣称薄荷提取物、酵母提取物也辅助了美白作用，不过还待笔者考证。整体来看，美白祛斑作用有，但不是很强，没有同品牌的美白精华作用强，需要长期使用才能看出效果。"},{"cmcid":13369,"threadCount":0,"id":187233,"name":"焕彩亮白日光防护霜","title":"修丽可焕彩亮白日光防护霜 SPF30","func":"防晒,均匀肤色","price":"300.00","pic":"http://img.ilikelabs.com/Uploads/170/170935_0-508-508@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":2,"security":-1,"brand":"5621","activeTime":"2016-12-18 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。修丽可焕彩亮白日光防护霜是一款广谱防晒霜，可以同时防护UVA和UVB，防晒指数为SPF30 PA+++。防晒剂采用了3个化学防晒剂、1个物理防晒剂，其中对苯二亚甲基二樟脑磺酸（Mexoryl SX）和甲酚曲唑三硅氧烷（Mexoryl XL）是欧莱雅的专利防晒剂，物理防晒剂二氧化钛同时可以增白肤色。这4个防晒剂防护紫外线光谱全面，物化结合的配方，避免纯物理防晒的白腻厚重，也可减低化学防晒剂的用量，保证了较强的防晒效果和较好的肤感。配方的主体系类似冷霜，环聚二甲基硅氧烷和变性乙醇在涂抹时带来清爽感，也没有添加动植物油脂，因为防晒霜通常比较油腻，这样的设计可以降低油腻感，也令这款防晒霜的功效更单纯。保湿成分主要是甘油、丙二醇，还添加了2种植物成分，帮助缓解肌肤光老化产生皱纹。产品没有添加香精，防腐体系为苯氧乙醇+2个尼泊金酯类，防晒剂体系比较温和。"},{"cmcid":13377,"threadCount":0,"id":187242,"name":"维生素B5保湿面膜","title":"修丽可维生素B5保湿面膜","func":"补水,保湿","price":"640.00","pic":"http://img.ilikelabs.com/Uploads/172/172215_0-450-450@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":4,"security":-1,"brand":"5621","activeTime":"2016-12-15 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":false,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。修丽可维生素B5保湿面膜是一款啫喱状面膜，不含油脂，水溶性成分，利用卡波姆增稠。主保湿剂是甘油、 1%透明质酸钠，保湿补水作用强，其他保湿剂也不容忽视，包括：PCA钠、尿素、海藻糖、泛酸钙、泛醇等，都是高效的保湿成分，可以缓解肌肤干痒脱屑的状况。本品是不需要洗去的，对于油性肤质来说，不油腻，用完可以不再用其他产品，但对于干性肤质来说，因为不含油脂，滋润度不够，所以还是需要再用一点含油脂的乳液或面霜加强保湿。产品没有添加香精，含2种较温和的防腐剂，配方整体比较温和。"},{"cmcid":13367,"threadCount":1,"id":187231,"name":"臻薄物理日光防护乳","title":"修丽可臻薄物理日光防护乳SPF30+ PA+++","func":"防晒,修饰肤色","price":"390.00","pic":"http://img.ilikelabs.com/Uploads/172/172204_0-433-433@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":75,"security":-1,"brand":"5621","activeTime":"2016-12-13 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":8,"reviewScore":"9.7","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。修丽可臻薄物理日光防护乳是一款纯物理防晒产品，含5%氧化锌、6%二氧化钛，防晒值可以达到SPF50 PA+++。通常纯物理防晒剂很难达到这么高的防晒指数，但是经过特殊表面处理的氧化锌和二氧化钛是可以的，欧莱雅在防晒产品上的优秀技术是公认。值得注意的是卤虫提取物，可以抵御紫外线在内的各种环境压力，缓解皮肤老化问题。高含量的物理防晒产品容易有拔干的感觉，所以这个产品中润肤成分含量比较高，包括长链烷烃、硅油、合成酯等，同时它们也起到溶剂的作用，与高分子聚合物一起，使物理粉末均匀分布。产品没有添加香精，防腐剂主要是苯氧乙醇，防晒剂体系温和。"},{"cmcid":263277,"threadCount":0,"id":3013937,"name":"均衡净化爽肤水","title":"修丽可均衡净化爽肤水","func":"细致毛孔,保湿,控油","price":"380.00","pic":"http://img.ilikelabs.com//Uploads/218/218117_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":8,"security":-1,"brand":"5621","activeTime":"2016-12-11 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克，最有名的产品是杜克色修精华。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款爽肤水主要是利用植物成分帮助平衡油脂分泌、收缩毛孔。药鼠尾草、母菊、芦荟、金缕梅、迷迭香具有抗炎、镇静、收敛作用，是很多祛痘、控油产品喜欢使用的植物成分。其他的植物成分，比如欧洲越桔果、糖槭、黄瓜、麝香草等起到了保湿、活肤、抗衰老的作用。通常控油、收缩毛孔作用比较强的爽肤水喜欢添加乙醇、水杨酸等成分，但这款爽肤水没有添加这类成分，属于比较温和的爽肤水，对于干性肌肤又毛孔大的肤质可以试试，但是保湿性不是很强，当然油性肤质也是适合的。不含香精，甜橙果皮油起到了芳香剂作用，含2种防腐剂。"},{"cmcid":9220,"threadCount":0,"id":74953,"name":"果酸焕活复颜精华液","title":"修丽可果酸焕活复颜精华液","func":"祛痘,美白淡斑,抗衰老,控油","price":"400.00","pic":"http://img.ilikelabs.com/Uploads/92/92461_0.jpg@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":9,"security":-1,"brand":"5621","activeTime":"2016-12-08 06:00:00","suitableSkin":["3000","3003","3030","3033","3100","3103","3130","3133","2000","2003","2030","2033","2100","2103","2130","2133"],"skinSuggestion":{"dryHeavy":false,"dryLight":false,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克，最有名的产品是杜克色修精华。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款产品是滴管瓶包装，含量30ml，产品外观为液体，大部分成分是水溶性，肤感轻薄。作为精华使用，主要功效是促进角质更新、抗衰老。成分中变性乙醇含量最高，其次是水，主要是作为溶剂，涂抹时肤感清凉。含2种果酸：3.5%羟基乙酸+0.5%柠檬酸，还添加了2%十八碳烯二酸、1.5%水杨酸、0.3%辛酰水杨酸，产品的pH值范围是3.6-4.6，偏酸，所以有些人使用时会感觉有刺痛感。这几种酸各发挥不同的作用，可以促进角质更新、美白淡斑、控油祛痘。对于油脂分泌过多、角质层比较厚的痘肌，可以坚持使用一段时间，但因为产品会有点刺激，不要大量使用，而是少量长时间使用，并且白天一定要使用防晒霜及遮阳，当然如果出现不良反应还是需要停用。如果没有痘痘困扰，这款产品也可以解决角质层厚、抗衰老、美白、控油等问题，当然使用时也需要遵循前面提到的注意事项。"},{"cmcid":13376,"threadCount":0,"id":187241,"name":"海洋精华保湿霜","title":"修丽可海洋精华保湿霜","func":"抗菌消炎,保湿,抗衰老,控油","price":"700.00","pic":"http://img.ilikelabs.com/Uploads/171/171846_0-430-430@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":8,"security":-1,"brand":"5621","activeTime":"2016-12-06 06:00:00","suitableSkin":["3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233"],"skinSuggestion":{"dryHeavy":false,"dryLight":false,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款保湿霜的主体结构是比较传统的雪花膏式，由硬脂酸、棕榈酸、肉豆蔻酸与三乙醇胺形成皂化体系，肤感不油腻。保湿成分中合成酯、甘油、野大豆油是含量较高的保湿剂，同时也添加了少量环状硅油、泛醇、尿囊素、透明质酸钠，这些成分肤感比较轻薄，保湿能力可以满足油性肤质的需求。比较有特色的成分是其名称中与海洋有关系的4种藻类提取物和7种陆地植物提取物。藻类提取物的作用主要是保湿、活肤、补充微量元素，作为复配成分，其总体含量在配方中是排在第二位的。陆地植物提取物中，长穗地榆根、姜根、肉桂树皮、母菊花等具有抗炎抗衰老作用，这种设计很符合修丽可抗敏感系列产品的理念，金缕梅等植物成分还能够帮助控油。产品不含香精，含苯氧乙醇和尼泊金酯类复配的防腐剂，配方整体比较温和。"},{"cmcid":9214,"threadCount":1,"id":74915,"name":"维生素B5保湿凝胶","title":"修丽可维生素B5保湿凝胶","func":"保湿","price":"680.00","pic":"http://img.ilikelabs.com/Uploads/92/92327_0.jpg@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":116,"security":-1,"brand":"5621","activeTime":"2016-12-04 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":14,"reviewScore":"8.7","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。修丽可维生素B5保湿凝胶的功效很简单，就是保湿，含多种保湿剂，成分都是水溶性的，不含油脂，更适合油性肤质使用。基础保湿剂是甘油，接下来就是保湿功能强大的透明质酸钠。名称中的维生素B5（泛酸）在成分中是以泛酸钙形式添加，可缓解肌肤干燥、脱屑、皮炎的情况。其他的保湿成分还有PCA钠、尿素、海藻糖，都是常用且高效的保湿成分。产品没有添加增稠剂，所以外观是液体，不是胶体。不含香精，含2种较温和的防腐剂，配方整体比较温和。"},{"cmcid":225544,"threadCount":0,"id":2984231,"name":"臻白修护日间精华液","title":"修丽可臻白修护日间精华液","func":"祛皱,美白淡斑,抗衰老","price":"780.00","pic":"http://img.ilikelabs.com/Uploads/213/213222_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":24,"security":-1,"brand":"5621","activeTime":"2016-12-01 06:00:00","suitableSkin":["3000","3003","3030","3033","3100","3103","3130","3133","2000","2003","2030","2033","2100","2103","2130","2133"],"skinSuggestion":{"dryHeavy":false,"dryLight":false,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":1,"reviewScore":"10.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款产品是滴管瓶包装，含量30ml，作为精华使用，主要功效是美白+抗氧化。产品外观为液体，大部分成分是水溶性。成分中VC含量很高，高达10%，美白祛斑和抗击自由基作用强大。与同品牌的VC精华液相比，同样含10%VC、0.5%阿魏酸，在国家药监局备案的pH值范围是2.2-2.8，比VC精华液的2.00-2.60稍高一点。不同之处在于添加了2%根皮素，根皮素在苹果皮中大量存在，具有消除自由基、活肤抗氧的作用，还可用于治疗皮脂分泌过多和因此引起的痤疮，也有美白作用；其另一个作用是能够防晒，减少光过敏，这也是这款高VC含量的精华可以在白天使用的关键。根皮素不溶于水，但是可溶于乙醇，因此这个产品中添加了变性乙醇作为溶剂。同时相比VC精华液，不含透明质酸钠，保湿性方面差了一点，但用起来更清爽。仍需要提醒的是，如果肌肤使用后感觉不适，需要停用，低pH值的产品可能会令肌肤对阳光的刺激变得更敏感，白天用一定要使用防晒霜或者遮阳。敏感肌肤如果对修丽可的VC感兴趣，可以先从这款10%VC精华用起，不过要小心使用。VC本身很不稳定，因此产品的外包装是棕色玻璃瓶，平时储存也应保持避光，每次用完拧紧。产品不含香精和防腐剂。"},{"cmcid":191250,"threadCount":0,"id":2949939,"name":"植萃舒缓亮妍精华露","title":"修丽可植萃舒缓亮妍精华露","func":"舒缓,修护肌肤,抗敏,美白淡斑,抗菌消炎","price":"595.00","pic":"http://img.ilikelabs.com//Uploads/217/217719_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":17,"security":-1,"brand":"5621","activeTime":"2016-11-29 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款产品是该品牌最有名的产品，很多人把它叫作杜克色修。滴管瓶包装，含量30ml，作为精华使用，主要功效是舒缓敏感肌肤。产品外观为绿色液体，含有色素，成分都是水溶性，质感轻薄不油腻。基础成分是水、甘油、丙二醇，起到保湿和溶剂的作用，功效成分是6种植物提取物+透明质酸钠。其中含量最高的油橄榄叶提取物对巨噬细胞（可吞噬黑色素）活性有极强的激活作用，从而对皮肤有增白作用，同时还兼具抗菌、抗过敏、防粉刺的作用。其余的植物成分：黄瓜果提取物可以防粉刺、美白、促进胶原蛋白生成；迷迭香叶提取物有极好的抗氧化性能，具有抗衰老、抗炎、抗菌作用；柚果提取物可以抗炎、收缩毛孔、促进伤口愈合；麝香草提取物具有抗炎、促进伤口愈合作用，还可修护红血丝；桑根提取物具有美白、抗炎作用。由此可见，杜克色修对于植物成分的选择是非常有针对性的，功效主要集中在舒缓肌肤敏感、修复受损肌肤、消除炎症方面，同时还可促进美白和护理粉刺肌肤。杜克色修的美白作用并不会比同品牌的CE复合液强大，主要是修复泛红型的肌肤，消除炎症引起的肌肤发红、敏感问题。推荐敏感肌肤、炎症粉刺引起的泛红肌肤使用。这款产品是升级版，相比老版多了1种植物成分：迷迭香叶提取物。"},{"cmcid":9216,"threadCount":0,"id":74925,"name":"维生素CE复合修护精华液","title":"修丽可维生素CE复合修护精华液","func":"祛皱,美白淡斑,抗衰老","price":"1490.00","pic":"http://img.ilikelabs.com/Uploads/180/180944_0-500-500@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":54,"security":-1,"brand":"5621","activeTime":"2016-11-27 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","1000","1003","1030","1033","1100","1103","1130","1133","2000","2003","2030","2033","2100","2103","2130","2133","3000","3003","3030","3033","3100","3103","3130","3133"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":3,"reviewScore":"9.3","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克，最有名的产品是杜克色修精华。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款产品是滴管瓶包装，含量30ml，作为精华使用，主要功效是美白+抗氧化。产品外观为液体，大部分成分是水溶性，油溶性的VE和阿魏酸也通过增溶剂的作用与亲水成分融为一体。成分中VC含量很高，高达15%，美白祛斑和抗击自由基作用强大。其他功效成分是1%VE和0.5%阿魏酸：VE具有清除自由基、延缓光老化、减少皱纹的作用；阿魏酸有广谱的抗氧性，能够活肤、增白。据品牌创始人皮纳尔教授的研究发现，阿魏酸可以使C+E的抗氧化能力得到进一步提升，达到与众不同的高效抗氧化效果。需要注意的是这款产品的pH值低于3.5，其在国家药监局备案的pH值范围是2.00-2.60，作为一款功能性强大、高VC含量的产品是可以理解的，那么消费者需要注意的是用量，不要一次性或者短期大剂量使用，如果肌肤使用后感觉不适，需要停用，毕竟美白和抗衰老需要长期的呵护才会有效。低pH值的产品可能会令肌肤对阳光的刺激变得更敏感，所以如果白天用，一定要使用防晒霜或者遮阳，或者只在晚上用，不建议敏感肌肤使用这款产品。VC本身很不稳定，因此产品的外包装是棕色玻璃瓶，平时储存也应保持避光，每次用完拧紧。产品不含香精，防腐剂苯氧乙醇较温和。"},{"cmcid":13368,"threadCount":0,"id":187232,"name":"维生素C温和修护精华液","title":"修丽可维生素C温和修护精华液","func":"祛皱,美白淡斑,抗衰老","price":"800.00","pic":"http://img.ilikelabs.com/Uploads/170/170933_0-443-443@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":17,"security":-1,"brand":"5621","activeTime":"2016-11-25 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","1000","1003","1030","1033","1100","1103","1130","1133","2000","2003","2030","2033","2100","2103","2130","2133","3000","3003","3030","3033","3100","3103","3130","3133"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克，最有名的产品是杜克色修精华。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款产品是滴管瓶包装，含量30ml，作为精华使用，主要功效是美白+抗氧化。产品外观为液体，大部分成分是水溶性，油溶性的阿魏酸也通过增溶剂的作用与亲水成分融为一体。成分中VC含量很高，高达10%，美白祛斑和抗击自由基作用强大。与同品牌的CE复合精华液相比，VC含量低一些，不含有VE，含有0.5%阿魏酸，相对温和一些。但其pH值与CE复合精华液一样，在国家药监局备案的pH值范围是2.00-2.60，作为一款功能性强大、高VC含量的产品是可以理解的，那么消费者需要注意的是用量，不要一次性或者短期大剂量使用，如果肌肤使用后感觉不适，需要停用，毕竟美白和抗衰老需要长期的呵护才会有效。低pH值的产品可能会令肌肤对阳光的刺激变得更敏感，所以如果白天用，一定要使用防晒霜或者遮阳，或者只在晚上用。敏感肌肤如果对修丽可的VC感兴趣，可以先从这款10%VC精华用起，不过要小心使用。VC本身很不稳定，因此产品的外包装是棕色玻璃瓶，平时储存也应保持避光，每次用完拧紧。产品不含香精和防腐剂。"},{"cmcid":169404,"threadCount":1,"id":2929583,"name":"温和滋润洁面乳","title":"修丽可温和滋润洁面乳","func":"清洁","price":"380.00","pic":"http://img.ilikelabs.com/Uploads/191/191930_0-400-400@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":12,"security":-1,"brand":"5621","activeTime":"2016-11-22 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":false,"oilHeavy":false,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克，最有名的产品是杜克色修精华。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款洁面乳属于乳霜状无泡洁面乳，基础成分是合成酯、长链脂肪醇、多元醇，清洁过程不起泡，适合干性肤质。整体来说成分比较简单，不花俏，这样能够保持温和、低刺激性，所以对于敏感性肤质是不错的选择。添加了少量的尿囊素成分，因为是清洁类产品，所以其主要发挥的作用是镇静、收敛、抗炎作用。产品不含香精，而是添加了甜橙果皮油，使得产品在使用时具有淡淡的橙香味，但是甜橙油也含有一些可能会致敏的天然成分，不过这款产品整体是温和的洗去型产品，但仍建议特别敏感的人群做一下皮肤测试。"},{"cmcid":263258,"threadCount":0,"id":3013936,"name":"赋活精华素","title":"美瑞可赋活精华素","func":"祛皱,滋润,抗衰老","price":"299.00","pic":"http://img.ilikelabs.com/Uploads/217/217439_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":3,"security":-1,"brand":"5884","activeTime":"2016-11-20 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":false,"oilHeavy":false,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"美瑞可","brandEnName":"MATRICARE","effectAbstract":"这款产品是胶囊形式的包装，干净卫生，方便使用，也是很多精华油经常采用的包装形式。美瑞可赋活精华素是以油脂为主要成分的精华，水含量很低。视黄醇（VA）和角鲨烯是含量最高的2个油脂，视黄醇具有活肤抗衰老作用；角鲨烯是人体皮脂中的成分，对于干性肌肤适当的补充角鲨烯可以帮助缓解干燥，保护皮肤，因为其良好的肌肤亲和性，可以帮助产品中的其他成分更好的吸收。产品是以抗衰老为主要功效，除VA外，还添加了玻璃苣籽油 PEG-7 聚二甲基硅氧烷酯类、透明质酸钠、茶儿茶素类、葡萄籽油、生育酚(维生素E)、水解胶原等6种有效成分，帮助抗击自由基，延缓衰老，缓解肌肤干燥。其中的玻璃苣籽油 PEG-7 聚二甲基硅氧烷酯类也充当了乳化剂的作用，使产品呈现微乳化体系，更有利于营养成分吸收。配方中不含香精、防腐剂，添加了2种芳香植物精油：母菊花油和玫瑰花油，气味芬芳，但天然芳香精油也有致敏的可能，敏感肌肤应做好皮肤测试后使用。"},{"cmcid":229949,"threadCount":0,"id":2988632,"name":"阿魏酸精纯液","title":"美瑞可阿魏酸精纯液","func":"抗敏,防晒,美白淡斑,抗菌消炎,保湿,抗衰老","price":"1680.00","pic":"http://img.ilikelabs.com//Uploads/217/217214_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":11,"security":-1,"brand":"5884","activeTime":"2016-11-17 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":2,"reviewScore":"6.0","star":0,"brandChinaName":"美瑞可","brandEnName":"MATRICARE","effectAbstract":"这款产品是滴管瓶包装，含量10ml，作为精华使用，每次2滴。产品外观为液体，基础成分都是亲水成分，使用时并不会像纯油脂的精华油那么油腻。基础成分氢化鳄梨油、双丙甘醇、甘油是常见的保湿剂，与另外3种多元醇及聚乙二醇-8一起，作为功效成分的溶剂载体，便于涂抹和吸收。PEG-40 氢化蓖麻油在其中起到了增溶剂的左右，使红没药醇和阿魏酸与其他成分相融为一体。阿魏酸有广谱的抗氧性，能够活肤、增白、抗炎、抑制过敏，它还常用于防晒产品，可防止UVB引起的皮肤红斑，有抗光毒性作用。红没药醇天然存在于菊科植物精油中，具有抗炎、止痛、缓和刺激、抗过敏作用，同时其具有高渗透性，可提高活性成分的吸收率。成分中不含水，不易于微生物生长，所以没有添加防腐剂，而且1,2-己二醇和辛甘醇具有一定的抗菌作用。"},{"cmcid":229950,"threadCount":0,"id":2988633,"name":"泛醌（辅酶Q10）精纯液","title":"美瑞可泛醌（辅酶Q10）精纯液","func":"抗菌消炎,保湿,抗衰老","price":"2100.00","pic":"http://img.ilikelabs.com//Uploads/217/217210_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":3,"security":-1,"brand":"5884","activeTime":"2016-11-14 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"美瑞可","brandEnName":"MATRICARE","effectAbstract":"这款产品是滴管瓶包装，含量10ml，作为精华使用，每次2滴，也可以用上一段时间。产品外观为液体，基础成分都是亲水成分，使用时并不会像纯油脂的精华油那么油腻。基础成分氢化鳄梨油、双丙甘醇、甘油是常见的保湿剂，与另外3种多元醇一起，作为功效成分的溶剂载体，便于涂抹和吸收。PEG-40 氢化蓖麻油在其中起到了增溶剂的左右，使红没药醇和泛醌与其他成分相融为一体。泛醌就是我们平时说的辅酶Q10，是一种生物酶，具有公认的抗衰老作用，是人体内天然的抗氧化剂，减少自由基生成，还也具有抗炎作用。红没药醇天然存在于菊科植物精油中，具有抗炎、止痛、缓和刺激、抗过敏作用，同时其具有高渗透性，可提高泛醌的吸收率。成分中不含水，不易于微生物生长，所以没有添加防腐剂，而且1,2-己二醇和辛甘醇具有一定的抗菌作用。泛醌遇光易分解，所以产品的包装为茶色玻璃，开封后也应该尽快用完，并储存于避光处。"},{"cmcid":188650,"threadCount":0,"id":2947339,"name":"维生素A E精纯液","title":"美瑞可维生素A E精纯液","func":"祛皱,保湿,抗衰老","price":"1380.00","pic":"http://img.ilikelabs.com//Uploads/217/217207_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":0,"security":-1,"brand":"5884","activeTime":"2016-11-11 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","1000","1003","1030","1033","1100","1103","1130","1133","2000","2003","2030","2033","2100","2103","2130","2133"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":false,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"美瑞可","brandEnName":"MATRICARE","effectAbstract":"这款产品是滴管瓶包装，含量10ml，作为精华使用，每次2滴，也可以用上一段时间。产品外观为液体，基础成分都是亲水成分，使用时并不会像纯油脂的精华油那么油腻。基础成分氢化鳄梨油、丙二醇、甘油是常见的保湿剂，与另外3种多元醇一起，作为VA和VE的溶剂载体，便于涂抹和吸收。因为VA和VE是油溶性成分，PEG-40 氢化蓖麻油在其中起到了增溶剂的左右，使亲油相和亲水相融为一体。缺少VA的肌肤会变厚变干，VA（视黄醇）可以被皮肤吸收，能够保持肌肤柔软、丰满，活化肌肤，调节表皮细胞分裂，延缓衰老，减少角质化，对粉刺也有疗效。VE（生育酚）具有清除自由基、延缓光老化、减少皱纹的作用。如果你有皮肤角质化问题，可以选择这款精华液，当然也可以利用它抗击肌肤衰老。成分中不含水，不易于微生物生长，所以没有添加防腐剂，而且1,2-己二醇和辛甘醇具有一定的抗菌作用。"},{"cmcid":188658,"threadCount":1,"id":2947347,"name":"维生素B3精纯液","title":"美瑞可维生素B3精纯液","func":"舒缓,抗菌消炎,保湿","price":"790.00","pic":"http://img.ilikelabs.com/Uploads/216/216967_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":30,"security":-1,"brand":"5884","activeTime":"2016-11-09 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"美瑞可","brandEnName":"MATRICARE","effectAbstract":"这款产品是滴管瓶包装，含量10ml，作为精华使用，每次2滴，也可以用上一段时间。产品外观为液体，基础成分都是亲水成分，使用时并不会像纯油脂的精华油那么油腻。基础成分氢化鳄梨油、丙二醇、甘油是常见的保湿剂，与另外3种多元醇一起，作为功效成分的溶剂载体，便于涂抹和吸收。PEG-40 氢化蓖麻油在其中起到了增溶剂的左右，使红没药醇与其他成分相融为一体。烟酰胺（维生素B3）是一个具有多重功效的万能成分，宝洁公司旗下的品牌OLAY（玉兰油）是最喜欢用这个成分的，其主要功效是抗衰老和美白。在这个产品中，烟酰胺含量不是很高，美白作用并不是最主要的，它在此产品中主要起到促进新陈代谢，改善肌肤质地，减少暗沉，改善肌肤屏障功能，平衡油脂分泌的作用。红没药醇天然存在于菊科植物精油中，具有抗炎、止痛、缓和刺激、抗过敏作用，同时其具有高渗透性，可提高其他功效成分吸收。成分中不含水，不易于微生物生长，所以没有添加防腐剂，而且1,2-己二醇和辛甘醇具有一定的抗菌作用。烟酰胺不适合红血丝肌肤使用，本品中烟酰胺含量不高，但还是不建议红血丝严重的人群使用。"},{"cmcid":229947,"threadCount":0,"id":2988630,"name":"修护菁华液","title":"美瑞可修护菁华液","func":"修护肌肤,抗菌消炎,保湿","price":"1200.00","pic":"http://img.ilikelabs.com/Uploads/216/216633_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":35,"security":-1,"brand":"5884","activeTime":"2016-11-03 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":3,"reviewScore":"10.0","star":0,"brandChinaName":"美瑞可","brandEnName":"MATRICARE","effectAbstract":"这款产品是安瓿瓶包装，为保持功效成分的活性，在使用时才将粉末状的活性成分溶解在以水、甘油、防腐剂为基质的溶剂中，并且需要在30天内用完。这也是目前护肤品的一种发展趋势，对于功能性比较强的产品，很多功效成分很容易失活，那么少量并在短时间内用完，能够使产品更有效的护理肌肤。这款精华液的主要功效成分分为2个方面:1.保湿成分：海藻糖+透明质酸钠，这2个成分都是生物来源的原料，保湿性强，安全不刺激。海藻糖保湿又抗炎，同时具有很好的亲肤性，可增加皮肤对营养成分的吸收。在这个配方中，海藻糖与胶原和氨基酸配伍性好，不易导致产品变色。透明质酸钠的保湿左右不用赘述了，其强大的保湿性能已是尽人皆知。2.肌肤修复成分：胶原+4种氨基酸，胶原蛋白本身就是氨基酸组成的，再搭配其他氨基酸，能够促进肌肤表面一些小的损伤愈合。4种氨基酸综合作用是抗炎、保持皮肤水分、减少皮屑、促进愈合。胶原和氨基酸同样是通过生物方法制取，安全不刺激。这款产品推荐皮肤干燥、皮肤表面有小损伤的人群使用。因为美瑞可品牌是医疗美容品牌，在医美手术后使用，也有一定的针对性。产品中可能会引起刺激的成分是3种防腐剂，但因为产品本身开封后只能使用30天，所以防腐剂含量应该不高，如果你确定对某些防腐剂过敏，那么需要谨慎选择。"},{"cmcid":197669,"threadCount":1,"id":2956358,"name":"金盏花柔嫩精华乳","title":"菲诗小铺金盏花柔嫩精华乳","func":"舒缓,保湿","price":"88.00","pic":"http://img.ilikelabs.com/Uploads/213/213346_0-800-800@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":348,"security":-1,"brand":"3964","activeTime":"2016-09-12 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","1000","1003","1030","1033","1100","1103","1130","1133","2000","2003","2030","2033","2100","2103","2130","2133"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":false,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":70,"reviewScore":"5.2","star":0,"brandChinaName":"菲诗小铺","brandEnName":"The Face Shop","effectAbstract":"这款柔嫩精华乳设计成水包油的体系，润肤剂以合成酯、矿油、挥发性硅油为主，还含有少量长链脂肪醇、吸留性硅油、异链烷烃、角鲨烷等。这样的油分设计，兼顾了保湿和使用感的清爽。乳液中含有8种植物提取物，配方量最高的金盏花花提取物，具有抗衰老、抗炎、保湿功效。金盏花提取物的应用历史非常久远，欧洲中世纪就开始应用它治疗皮肤病，长期以来也应用于各种皮肤急救药膏。产品中含有香精，含有防腐剂苯氧乙醇和5种尼泊金酯类。"}],"productBannerImage":"http://img.ilikelabs.com/Uploads/206/206272_0-750-300@750w_1x.jpg","productStock":15,"productBeginDate":"2016-06-09 20:00:00","currentDate":"2016-12-23 14:42:13","objectId":102}
     */

    private int error_code;
    private String message;
    private DataBean data;

    public int getError_code() {
        return error_code;
    }

    public void setError_code(int error_code) {
        this.error_code = error_code;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * list : [{"cmcid":187915,"threadCount":0,"id":2946604,"name":"焕采无瑕精华乳","title":"修丽可焕采无瑕精华乳","func":"美白淡斑,保湿","price":"780.00","pic":"http://img.ilikelabs.com//Uploads/218/218524_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":4,"security":-1,"brand":"5621","activeTime":"2016-12-20 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","1000","1003","1030","1033","1100","1103","1130","1133","2000","2003","2030","2033","2100","2103","2130","2133","3000","3003","3030","3033","3100","3103","3130","3133"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。修丽可焕采无瑕精华乳是一款美白祛斑产品，产品的保湿成分有多元醇、合成酯、硅油等，保湿性好，质地不厚重。含多种美白成分，并且每个美白成分都从不同层面帮助抗击黑色素：1.水杨酸0.3%：促进角质剥脱，可加快色斑部位的角质更新速度。2.鞣花酸0.5%：可抑制酪氨酸酶活性，从源头抑制黑色素生成，从而美白祛斑。3.具有美白作用的植物成分：向日葵籽提取物+光果甘草根提取物+杏叶提取物。厂家宣称薄荷提取物、酵母提取物也辅助了美白作用，不过还待笔者考证。整体来看，美白祛斑作用有，但不是很强，没有同品牌的美白精华作用强，需要长期使用才能看出效果。"},{"cmcid":13369,"threadCount":0,"id":187233,"name":"焕彩亮白日光防护霜","title":"修丽可焕彩亮白日光防护霜 SPF30","func":"防晒,均匀肤色","price":"300.00","pic":"http://img.ilikelabs.com/Uploads/170/170935_0-508-508@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":2,"security":-1,"brand":"5621","activeTime":"2016-12-18 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。修丽可焕彩亮白日光防护霜是一款广谱防晒霜，可以同时防护UVA和UVB，防晒指数为SPF30 PA+++。防晒剂采用了3个化学防晒剂、1个物理防晒剂，其中对苯二亚甲基二樟脑磺酸（Mexoryl SX）和甲酚曲唑三硅氧烷（Mexoryl XL）是欧莱雅的专利防晒剂，物理防晒剂二氧化钛同时可以增白肤色。这4个防晒剂防护紫外线光谱全面，物化结合的配方，避免纯物理防晒的白腻厚重，也可减低化学防晒剂的用量，保证了较强的防晒效果和较好的肤感。配方的主体系类似冷霜，环聚二甲基硅氧烷和变性乙醇在涂抹时带来清爽感，也没有添加动植物油脂，因为防晒霜通常比较油腻，这样的设计可以降低油腻感，也令这款防晒霜的功效更单纯。保湿成分主要是甘油、丙二醇，还添加了2种植物成分，帮助缓解肌肤光老化产生皱纹。产品没有添加香精，防腐体系为苯氧乙醇+2个尼泊金酯类，防晒剂体系比较温和。"},{"cmcid":13377,"threadCount":0,"id":187242,"name":"维生素B5保湿面膜","title":"修丽可维生素B5保湿面膜","func":"补水,保湿","price":"640.00","pic":"http://img.ilikelabs.com/Uploads/172/172215_0-450-450@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":4,"security":-1,"brand":"5621","activeTime":"2016-12-15 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":false,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。修丽可维生素B5保湿面膜是一款啫喱状面膜，不含油脂，水溶性成分，利用卡波姆增稠。主保湿剂是甘油、 1%透明质酸钠，保湿补水作用强，其他保湿剂也不容忽视，包括：PCA钠、尿素、海藻糖、泛酸钙、泛醇等，都是高效的保湿成分，可以缓解肌肤干痒脱屑的状况。本品是不需要洗去的，对于油性肤质来说，不油腻，用完可以不再用其他产品，但对于干性肤质来说，因为不含油脂，滋润度不够，所以还是需要再用一点含油脂的乳液或面霜加强保湿。产品没有添加香精，含2种较温和的防腐剂，配方整体比较温和。"},{"cmcid":13367,"threadCount":1,"id":187231,"name":"臻薄物理日光防护乳","title":"修丽可臻薄物理日光防护乳SPF30+ PA+++","func":"防晒,修饰肤色","price":"390.00","pic":"http://img.ilikelabs.com/Uploads/172/172204_0-433-433@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":75,"security":-1,"brand":"5621","activeTime":"2016-12-13 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":8,"reviewScore":"9.7","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。修丽可臻薄物理日光防护乳是一款纯物理防晒产品，含5%氧化锌、6%二氧化钛，防晒值可以达到SPF50 PA+++。通常纯物理防晒剂很难达到这么高的防晒指数，但是经过特殊表面处理的氧化锌和二氧化钛是可以的，欧莱雅在防晒产品上的优秀技术是公认。值得注意的是卤虫提取物，可以抵御紫外线在内的各种环境压力，缓解皮肤老化问题。高含量的物理防晒产品容易有拔干的感觉，所以这个产品中润肤成分含量比较高，包括长链烷烃、硅油、合成酯等，同时它们也起到溶剂的作用，与高分子聚合物一起，使物理粉末均匀分布。产品没有添加香精，防腐剂主要是苯氧乙醇，防晒剂体系温和。"},{"cmcid":263277,"threadCount":0,"id":3013937,"name":"均衡净化爽肤水","title":"修丽可均衡净化爽肤水","func":"细致毛孔,保湿,控油","price":"380.00","pic":"http://img.ilikelabs.com//Uploads/218/218117_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":8,"security":-1,"brand":"5621","activeTime":"2016-12-11 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克，最有名的产品是杜克色修精华。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款爽肤水主要是利用植物成分帮助平衡油脂分泌、收缩毛孔。药鼠尾草、母菊、芦荟、金缕梅、迷迭香具有抗炎、镇静、收敛作用，是很多祛痘、控油产品喜欢使用的植物成分。其他的植物成分，比如欧洲越桔果、糖槭、黄瓜、麝香草等起到了保湿、活肤、抗衰老的作用。通常控油、收缩毛孔作用比较强的爽肤水喜欢添加乙醇、水杨酸等成分，但这款爽肤水没有添加这类成分，属于比较温和的爽肤水，对于干性肌肤又毛孔大的肤质可以试试，但是保湿性不是很强，当然油性肤质也是适合的。不含香精，甜橙果皮油起到了芳香剂作用，含2种防腐剂。"},{"cmcid":9220,"threadCount":0,"id":74953,"name":"果酸焕活复颜精华液","title":"修丽可果酸焕活复颜精华液","func":"祛痘,美白淡斑,抗衰老,控油","price":"400.00","pic":"http://img.ilikelabs.com/Uploads/92/92461_0.jpg@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":9,"security":-1,"brand":"5621","activeTime":"2016-12-08 06:00:00","suitableSkin":["3000","3003","3030","3033","3100","3103","3130","3133","2000","2003","2030","2033","2100","2103","2130","2133"],"skinSuggestion":{"dryHeavy":false,"dryLight":false,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克，最有名的产品是杜克色修精华。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款产品是滴管瓶包装，含量30ml，产品外观为液体，大部分成分是水溶性，肤感轻薄。作为精华使用，主要功效是促进角质更新、抗衰老。成分中变性乙醇含量最高，其次是水，主要是作为溶剂，涂抹时肤感清凉。含2种果酸：3.5%羟基乙酸+0.5%柠檬酸，还添加了2%十八碳烯二酸、1.5%水杨酸、0.3%辛酰水杨酸，产品的pH值范围是3.6-4.6，偏酸，所以有些人使用时会感觉有刺痛感。这几种酸各发挥不同的作用，可以促进角质更新、美白淡斑、控油祛痘。对于油脂分泌过多、角质层比较厚的痘肌，可以坚持使用一段时间，但因为产品会有点刺激，不要大量使用，而是少量长时间使用，并且白天一定要使用防晒霜及遮阳，当然如果出现不良反应还是需要停用。如果没有痘痘困扰，这款产品也可以解决角质层厚、抗衰老、美白、控油等问题，当然使用时也需要遵循前面提到的注意事项。"},{"cmcid":13376,"threadCount":0,"id":187241,"name":"海洋精华保湿霜","title":"修丽可海洋精华保湿霜","func":"抗菌消炎,保湿,抗衰老,控油","price":"700.00","pic":"http://img.ilikelabs.com/Uploads/171/171846_0-430-430@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":8,"security":-1,"brand":"5621","activeTime":"2016-12-06 06:00:00","suitableSkin":["3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233"],"skinSuggestion":{"dryHeavy":false,"dryLight":false,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款保湿霜的主体结构是比较传统的雪花膏式，由硬脂酸、棕榈酸、肉豆蔻酸与三乙醇胺形成皂化体系，肤感不油腻。保湿成分中合成酯、甘油、野大豆油是含量较高的保湿剂，同时也添加了少量环状硅油、泛醇、尿囊素、透明质酸钠，这些成分肤感比较轻薄，保湿能力可以满足油性肤质的需求。比较有特色的成分是其名称中与海洋有关系的4种藻类提取物和7种陆地植物提取物。藻类提取物的作用主要是保湿、活肤、补充微量元素，作为复配成分，其总体含量在配方中是排在第二位的。陆地植物提取物中，长穗地榆根、姜根、肉桂树皮、母菊花等具有抗炎抗衰老作用，这种设计很符合修丽可抗敏感系列产品的理念，金缕梅等植物成分还能够帮助控油。产品不含香精，含苯氧乙醇和尼泊金酯类复配的防腐剂，配方整体比较温和。"},{"cmcid":9214,"threadCount":1,"id":74915,"name":"维生素B5保湿凝胶","title":"修丽可维生素B5保湿凝胶","func":"保湿","price":"680.00","pic":"http://img.ilikelabs.com/Uploads/92/92327_0.jpg@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":116,"security":-1,"brand":"5621","activeTime":"2016-12-04 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":14,"reviewScore":"8.7","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。修丽可维生素B5保湿凝胶的功效很简单，就是保湿，含多种保湿剂，成分都是水溶性的，不含油脂，更适合油性肤质使用。基础保湿剂是甘油，接下来就是保湿功能强大的透明质酸钠。名称中的维生素B5（泛酸）在成分中是以泛酸钙形式添加，可缓解肌肤干燥、脱屑、皮炎的情况。其他的保湿成分还有PCA钠、尿素、海藻糖，都是常用且高效的保湿成分。产品没有添加增稠剂，所以外观是液体，不是胶体。不含香精，含2种较温和的防腐剂，配方整体比较温和。"},{"cmcid":225544,"threadCount":0,"id":2984231,"name":"臻白修护日间精华液","title":"修丽可臻白修护日间精华液","func":"祛皱,美白淡斑,抗衰老","price":"780.00","pic":"http://img.ilikelabs.com/Uploads/213/213222_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":24,"security":-1,"brand":"5621","activeTime":"2016-12-01 06:00:00","suitableSkin":["3000","3003","3030","3033","3100","3103","3130","3133","2000","2003","2030","2033","2100","2103","2130","2133"],"skinSuggestion":{"dryHeavy":false,"dryLight":false,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":1,"reviewScore":"10.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款产品是滴管瓶包装，含量30ml，作为精华使用，主要功效是美白+抗氧化。产品外观为液体，大部分成分是水溶性。成分中VC含量很高，高达10%，美白祛斑和抗击自由基作用强大。与同品牌的VC精华液相比，同样含10%VC、0.5%阿魏酸，在国家药监局备案的pH值范围是2.2-2.8，比VC精华液的2.00-2.60稍高一点。不同之处在于添加了2%根皮素，根皮素在苹果皮中大量存在，具有消除自由基、活肤抗氧的作用，还可用于治疗皮脂分泌过多和因此引起的痤疮，也有美白作用；其另一个作用是能够防晒，减少光过敏，这也是这款高VC含量的精华可以在白天使用的关键。根皮素不溶于水，但是可溶于乙醇，因此这个产品中添加了变性乙醇作为溶剂。同时相比VC精华液，不含透明质酸钠，保湿性方面差了一点，但用起来更清爽。仍需要提醒的是，如果肌肤使用后感觉不适，需要停用，低pH值的产品可能会令肌肤对阳光的刺激变得更敏感，白天用一定要使用防晒霜或者遮阳。敏感肌肤如果对修丽可的VC感兴趣，可以先从这款10%VC精华用起，不过要小心使用。VC本身很不稳定，因此产品的外包装是棕色玻璃瓶，平时储存也应保持避光，每次用完拧紧。产品不含香精和防腐剂。"},{"cmcid":191250,"threadCount":0,"id":2949939,"name":"植萃舒缓亮妍精华露","title":"修丽可植萃舒缓亮妍精华露","func":"舒缓,修护肌肤,抗敏,美白淡斑,抗菌消炎","price":"595.00","pic":"http://img.ilikelabs.com//Uploads/217/217719_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":17,"security":-1,"brand":"5621","activeTime":"2016-11-29 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款产品是该品牌最有名的产品，很多人把它叫作杜克色修。滴管瓶包装，含量30ml，作为精华使用，主要功效是舒缓敏感肌肤。产品外观为绿色液体，含有色素，成分都是水溶性，质感轻薄不油腻。基础成分是水、甘油、丙二醇，起到保湿和溶剂的作用，功效成分是6种植物提取物+透明质酸钠。其中含量最高的油橄榄叶提取物对巨噬细胞（可吞噬黑色素）活性有极强的激活作用，从而对皮肤有增白作用，同时还兼具抗菌、抗过敏、防粉刺的作用。其余的植物成分：黄瓜果提取物可以防粉刺、美白、促进胶原蛋白生成；迷迭香叶提取物有极好的抗氧化性能，具有抗衰老、抗炎、抗菌作用；柚果提取物可以抗炎、收缩毛孔、促进伤口愈合；麝香草提取物具有抗炎、促进伤口愈合作用，还可修护红血丝；桑根提取物具有美白、抗炎作用。由此可见，杜克色修对于植物成分的选择是非常有针对性的，功效主要集中在舒缓肌肤敏感、修复受损肌肤、消除炎症方面，同时还可促进美白和护理粉刺肌肤。杜克色修的美白作用并不会比同品牌的CE复合液强大，主要是修复泛红型的肌肤，消除炎症引起的肌肤发红、敏感问题。推荐敏感肌肤、炎症粉刺引起的泛红肌肤使用。这款产品是升级版，相比老版多了1种植物成分：迷迭香叶提取物。"},{"cmcid":9216,"threadCount":0,"id":74925,"name":"维生素CE复合修护精华液","title":"修丽可维生素CE复合修护精华液","func":"祛皱,美白淡斑,抗衰老","price":"1490.00","pic":"http://img.ilikelabs.com/Uploads/180/180944_0-500-500@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":54,"security":-1,"brand":"5621","activeTime":"2016-11-27 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","1000","1003","1030","1033","1100","1103","1130","1133","2000","2003","2030","2033","2100","2103","2130","2133","3000","3003","3030","3033","3100","3103","3130","3133"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":3,"reviewScore":"9.3","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克，最有名的产品是杜克色修精华。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款产品是滴管瓶包装，含量30ml，作为精华使用，主要功效是美白+抗氧化。产品外观为液体，大部分成分是水溶性，油溶性的VE和阿魏酸也通过增溶剂的作用与亲水成分融为一体。成分中VC含量很高，高达15%，美白祛斑和抗击自由基作用强大。其他功效成分是1%VE和0.5%阿魏酸：VE具有清除自由基、延缓光老化、减少皱纹的作用；阿魏酸有广谱的抗氧性，能够活肤、增白。据品牌创始人皮纳尔教授的研究发现，阿魏酸可以使C+E的抗氧化能力得到进一步提升，达到与众不同的高效抗氧化效果。需要注意的是这款产品的pH值低于3.5，其在国家药监局备案的pH值范围是2.00-2.60，作为一款功能性强大、高VC含量的产品是可以理解的，那么消费者需要注意的是用量，不要一次性或者短期大剂量使用，如果肌肤使用后感觉不适，需要停用，毕竟美白和抗衰老需要长期的呵护才会有效。低pH值的产品可能会令肌肤对阳光的刺激变得更敏感，所以如果白天用，一定要使用防晒霜或者遮阳，或者只在晚上用，不建议敏感肌肤使用这款产品。VC本身很不稳定，因此产品的外包装是棕色玻璃瓶，平时储存也应保持避光，每次用完拧紧。产品不含香精，防腐剂苯氧乙醇较温和。"},{"cmcid":13368,"threadCount":0,"id":187232,"name":"维生素C温和修护精华液","title":"修丽可维生素C温和修护精华液","func":"祛皱,美白淡斑,抗衰老","price":"800.00","pic":"http://img.ilikelabs.com/Uploads/170/170933_0-443-443@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":17,"security":-1,"brand":"5621","activeTime":"2016-11-25 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","1000","1003","1030","1033","1100","1103","1130","1133","2000","2003","2030","2033","2100","2103","2130","2133","3000","3003","3030","3033","3100","3103","3130","3133"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克，最有名的产品是杜克色修精华。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款产品是滴管瓶包装，含量30ml，作为精华使用，主要功效是美白+抗氧化。产品外观为液体，大部分成分是水溶性，油溶性的阿魏酸也通过增溶剂的作用与亲水成分融为一体。成分中VC含量很高，高达10%，美白祛斑和抗击自由基作用强大。与同品牌的CE复合精华液相比，VC含量低一些，不含有VE，含有0.5%阿魏酸，相对温和一些。但其pH值与CE复合精华液一样，在国家药监局备案的pH值范围是2.00-2.60，作为一款功能性强大、高VC含量的产品是可以理解的，那么消费者需要注意的是用量，不要一次性或者短期大剂量使用，如果肌肤使用后感觉不适，需要停用，毕竟美白和抗衰老需要长期的呵护才会有效。低pH值的产品可能会令肌肤对阳光的刺激变得更敏感，所以如果白天用，一定要使用防晒霜或者遮阳，或者只在晚上用。敏感肌肤如果对修丽可的VC感兴趣，可以先从这款10%VC精华用起，不过要小心使用。VC本身很不稳定，因此产品的外包装是棕色玻璃瓶，平时储存也应保持避光，每次用完拧紧。产品不含香精和防腐剂。"},{"cmcid":169404,"threadCount":1,"id":2929583,"name":"温和滋润洁面乳","title":"修丽可温和滋润洁面乳","func":"清洁","price":"380.00","pic":"http://img.ilikelabs.com/Uploads/191/191930_0-400-400@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":12,"security":-1,"brand":"5621","activeTime":"2016-11-22 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":false,"oilHeavy":false,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"修丽可","brandEnName":"SKIN CEUTICALS","effectAbstract":"修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克，最有名的产品是杜克色修精华。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。这款洁面乳属于乳霜状无泡洁面乳，基础成分是合成酯、长链脂肪醇、多元醇，清洁过程不起泡，适合干性肤质。整体来说成分比较简单，不花俏，这样能够保持温和、低刺激性，所以对于敏感性肤质是不错的选择。添加了少量的尿囊素成分，因为是清洁类产品，所以其主要发挥的作用是镇静、收敛、抗炎作用。产品不含香精，而是添加了甜橙果皮油，使得产品在使用时具有淡淡的橙香味，但是甜橙油也含有一些可能会致敏的天然成分，不过这款产品整体是温和的洗去型产品，但仍建议特别敏感的人群做一下皮肤测试。"},{"cmcid":263258,"threadCount":0,"id":3013936,"name":"赋活精华素","title":"美瑞可赋活精华素","func":"祛皱,滋润,抗衰老","price":"299.00","pic":"http://img.ilikelabs.com/Uploads/217/217439_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":3,"security":-1,"brand":"5884","activeTime":"2016-11-20 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":false,"oilHeavy":false,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"美瑞可","brandEnName":"MATRICARE","effectAbstract":"这款产品是胶囊形式的包装，干净卫生，方便使用，也是很多精华油经常采用的包装形式。美瑞可赋活精华素是以油脂为主要成分的精华，水含量很低。视黄醇（VA）和角鲨烯是含量最高的2个油脂，视黄醇具有活肤抗衰老作用；角鲨烯是人体皮脂中的成分，对于干性肌肤适当的补充角鲨烯可以帮助缓解干燥，保护皮肤，因为其良好的肌肤亲和性，可以帮助产品中的其他成分更好的吸收。产品是以抗衰老为主要功效，除VA外，还添加了玻璃苣籽油 PEG-7 聚二甲基硅氧烷酯类、透明质酸钠、茶儿茶素类、葡萄籽油、生育酚(维生素E)、水解胶原等6种有效成分，帮助抗击自由基，延缓衰老，缓解肌肤干燥。其中的玻璃苣籽油 PEG-7 聚二甲基硅氧烷酯类也充当了乳化剂的作用，使产品呈现微乳化体系，更有利于营养成分吸收。配方中不含香精、防腐剂，添加了2种芳香植物精油：母菊花油和玫瑰花油，气味芬芳，但天然芳香精油也有致敏的可能，敏感肌肤应做好皮肤测试后使用。"},{"cmcid":229949,"threadCount":0,"id":2988632,"name":"阿魏酸精纯液","title":"美瑞可阿魏酸精纯液","func":"抗敏,防晒,美白淡斑,抗菌消炎,保湿,抗衰老","price":"1680.00","pic":"http://img.ilikelabs.com//Uploads/217/217214_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":11,"security":-1,"brand":"5884","activeTime":"2016-11-17 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":2,"reviewScore":"6.0","star":0,"brandChinaName":"美瑞可","brandEnName":"MATRICARE","effectAbstract":"这款产品是滴管瓶包装，含量10ml，作为精华使用，每次2滴。产品外观为液体，基础成分都是亲水成分，使用时并不会像纯油脂的精华油那么油腻。基础成分氢化鳄梨油、双丙甘醇、甘油是常见的保湿剂，与另外3种多元醇及聚乙二醇-8一起，作为功效成分的溶剂载体，便于涂抹和吸收。PEG-40 氢化蓖麻油在其中起到了增溶剂的左右，使红没药醇和阿魏酸与其他成分相融为一体。阿魏酸有广谱的抗氧性，能够活肤、增白、抗炎、抑制过敏，它还常用于防晒产品，可防止UVB引起的皮肤红斑，有抗光毒性作用。红没药醇天然存在于菊科植物精油中，具有抗炎、止痛、缓和刺激、抗过敏作用，同时其具有高渗透性，可提高活性成分的吸收率。成分中不含水，不易于微生物生长，所以没有添加防腐剂，而且1,2-己二醇和辛甘醇具有一定的抗菌作用。"},{"cmcid":229950,"threadCount":0,"id":2988633,"name":"泛醌（辅酶Q10）精纯液","title":"美瑞可泛醌（辅酶Q10）精纯液","func":"抗菌消炎,保湿,抗衰老","price":"2100.00","pic":"http://img.ilikelabs.com//Uploads/217/217210_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":3,"security":-1,"brand":"5884","activeTime":"2016-11-14 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"美瑞可","brandEnName":"MATRICARE","effectAbstract":"这款产品是滴管瓶包装，含量10ml，作为精华使用，每次2滴，也可以用上一段时间。产品外观为液体，基础成分都是亲水成分，使用时并不会像纯油脂的精华油那么油腻。基础成分氢化鳄梨油、双丙甘醇、甘油是常见的保湿剂，与另外3种多元醇一起，作为功效成分的溶剂载体，便于涂抹和吸收。PEG-40 氢化蓖麻油在其中起到了增溶剂的左右，使红没药醇和泛醌与其他成分相融为一体。泛醌就是我们平时说的辅酶Q10，是一种生物酶，具有公认的抗衰老作用，是人体内天然的抗氧化剂，减少自由基生成，还也具有抗炎作用。红没药醇天然存在于菊科植物精油中，具有抗炎、止痛、缓和刺激、抗过敏作用，同时其具有高渗透性，可提高泛醌的吸收率。成分中不含水，不易于微生物生长，所以没有添加防腐剂，而且1,2-己二醇和辛甘醇具有一定的抗菌作用。泛醌遇光易分解，所以产品的包装为茶色玻璃，开封后也应该尽快用完，并储存于避光处。"},{"cmcid":188650,"threadCount":0,"id":2947339,"name":"维生素A E精纯液","title":"美瑞可维生素A E精纯液","func":"祛皱,保湿,抗衰老","price":"1380.00","pic":"http://img.ilikelabs.com//Uploads/217/217207_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":0,"security":-1,"brand":"5884","activeTime":"2016-11-11 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","1000","1003","1030","1033","1100","1103","1130","1133","2000","2003","2030","2033","2100","2103","2130","2133"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":false,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"美瑞可","brandEnName":"MATRICARE","effectAbstract":"这款产品是滴管瓶包装，含量10ml，作为精华使用，每次2滴，也可以用上一段时间。产品外观为液体，基础成分都是亲水成分，使用时并不会像纯油脂的精华油那么油腻。基础成分氢化鳄梨油、丙二醇、甘油是常见的保湿剂，与另外3种多元醇一起，作为VA和VE的溶剂载体，便于涂抹和吸收。因为VA和VE是油溶性成分，PEG-40 氢化蓖麻油在其中起到了增溶剂的左右，使亲油相和亲水相融为一体。缺少VA的肌肤会变厚变干，VA（视黄醇）可以被皮肤吸收，能够保持肌肤柔软、丰满，活化肌肤，调节表皮细胞分裂，延缓衰老，减少角质化，对粉刺也有疗效。VE（生育酚）具有清除自由基、延缓光老化、减少皱纹的作用。如果你有皮肤角质化问题，可以选择这款精华液，当然也可以利用它抗击肌肤衰老。成分中不含水，不易于微生物生长，所以没有添加防腐剂，而且1,2-己二醇和辛甘醇具有一定的抗菌作用。"},{"cmcid":188658,"threadCount":1,"id":2947347,"name":"维生素B3精纯液","title":"美瑞可维生素B3精纯液","func":"舒缓,抗菌消炎,保湿","price":"790.00","pic":"http://img.ilikelabs.com/Uploads/216/216967_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":30,"security":-1,"brand":"5884","activeTime":"2016-11-09 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":0,"reviewScore":"0.0","star":0,"brandChinaName":"美瑞可","brandEnName":"MATRICARE","effectAbstract":"这款产品是滴管瓶包装，含量10ml，作为精华使用，每次2滴，也可以用上一段时间。产品外观为液体，基础成分都是亲水成分，使用时并不会像纯油脂的精华油那么油腻。基础成分氢化鳄梨油、丙二醇、甘油是常见的保湿剂，与另外3种多元醇一起，作为功效成分的溶剂载体，便于涂抹和吸收。PEG-40 氢化蓖麻油在其中起到了增溶剂的左右，使红没药醇与其他成分相融为一体。烟酰胺（维生素B3）是一个具有多重功效的万能成分，宝洁公司旗下的品牌OLAY（玉兰油）是最喜欢用这个成分的，其主要功效是抗衰老和美白。在这个产品中，烟酰胺含量不是很高，美白作用并不是最主要的，它在此产品中主要起到促进新陈代谢，改善肌肤质地，减少暗沉，改善肌肤屏障功能，平衡油脂分泌的作用。红没药醇天然存在于菊科植物精油中，具有抗炎、止痛、缓和刺激、抗过敏作用，同时其具有高渗透性，可提高其他功效成分吸收。成分中不含水，不易于微生物生长，所以没有添加防腐剂，而且1,2-己二醇和辛甘醇具有一定的抗菌作用。烟酰胺不适合红血丝肌肤使用，本品中烟酰胺含量不高，但还是不建议红血丝严重的人群使用。"},{"cmcid":229947,"threadCount":0,"id":2988630,"name":"修护菁华液","title":"美瑞可修护菁华液","func":"修护肌肤,抗菌消炎,保湿","price":"1200.00","pic":"http://img.ilikelabs.com/Uploads/216/216633_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":35,"security":-1,"brand":"5884","activeTime":"2016-11-03 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":3,"reviewScore":"10.0","star":0,"brandChinaName":"美瑞可","brandEnName":"MATRICARE","effectAbstract":"这款产品是安瓿瓶包装，为保持功效成分的活性，在使用时才将粉末状的活性成分溶解在以水、甘油、防腐剂为基质的溶剂中，并且需要在30天内用完。这也是目前护肤品的一种发展趋势，对于功能性比较强的产品，很多功效成分很容易失活，那么少量并在短时间内用完，能够使产品更有效的护理肌肤。这款精华液的主要功效成分分为2个方面:1.保湿成分：海藻糖+透明质酸钠，这2个成分都是生物来源的原料，保湿性强，安全不刺激。海藻糖保湿又抗炎，同时具有很好的亲肤性，可增加皮肤对营养成分的吸收。在这个配方中，海藻糖与胶原和氨基酸配伍性好，不易导致产品变色。透明质酸钠的保湿左右不用赘述了，其强大的保湿性能已是尽人皆知。2.肌肤修复成分：胶原+4种氨基酸，胶原蛋白本身就是氨基酸组成的，再搭配其他氨基酸，能够促进肌肤表面一些小的损伤愈合。4种氨基酸综合作用是抗炎、保持皮肤水分、减少皮屑、促进愈合。胶原和氨基酸同样是通过生物方法制取，安全不刺激。这款产品推荐皮肤干燥、皮肤表面有小损伤的人群使用。因为美瑞可品牌是医疗美容品牌，在医美手术后使用，也有一定的针对性。产品中可能会引起刺激的成分是3种防腐剂，但因为产品本身开封后只能使用30天，所以防腐剂含量应该不高，如果你确定对某些防腐剂过敏，那么需要谨慎选择。"},{"cmcid":197669,"threadCount":1,"id":2956358,"name":"金盏花柔嫩精华乳","title":"菲诗小铺金盏花柔嫩精华乳","func":"舒缓,保湿","price":"88.00","pic":"http://img.ilikelabs.com/Uploads/213/213346_0-800-800@0e_500w_500h_1c_0i_1o_1x.jpg","usedNum":0,"likedCount":348,"security":-1,"brand":"3964","activeTime":"2016-09-12 06:00:00","suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","1000","1003","1030","1033","1100","1103","1130","1133","2000","2003","2030","2033","2100","2103","2130","2133"],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":false,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false},"skinSuggestionApplied":true,"recommendSkin":[""],"reviewCount":70,"reviewScore":"5.2","star":0,"brandChinaName":"菲诗小铺","brandEnName":"The Face Shop","effectAbstract":"这款柔嫩精华乳设计成水包油的体系，润肤剂以合成酯、矿油、挥发性硅油为主，还含有少量长链脂肪醇、吸留性硅油、异链烷烃、角鲨烷等。这样的油分设计，兼顾了保湿和使用感的清爽。乳液中含有8种植物提取物，配方量最高的金盏花花提取物，具有抗衰老、抗炎、保湿功效。金盏花提取物的应用历史非常久远，欧洲中世纪就开始应用它治疗皮肤病，长期以来也应用于各种皮肤急救药膏。产品中含有香精，含有防腐剂苯氧乙醇和5种尼泊金酯类。"}]
         * productBannerImage : http://img.ilikelabs.com/Uploads/206/206272_0-750-300@750w_1x.jpg
         * productStock : 15
         * productBeginDate : 2016-06-09 20:00:00
         * currentDate : 2016-12-23 14:42:13
         * objectId : 102
         */

        private String productBannerImage;
        private int productStock;
        private String productBeginDate;
        private String currentDate;
        private int objectId;
        private List<ListBean> list;

        public String getProductBannerImage() {
            return productBannerImage;
        }

        public void setProductBannerImage(String productBannerImage) {
            this.productBannerImage = productBannerImage;
        }

        public int getProductStock() {
            return productStock;
        }

        public void setProductStock(int productStock) {
            this.productStock = productStock;
        }

        public String getProductBeginDate() {
            return productBeginDate;
        }

        public void setProductBeginDate(String productBeginDate) {
            this.productBeginDate = productBeginDate;
        }

        public String getCurrentDate() {
            return currentDate;
        }

        public void setCurrentDate(String currentDate) {
            this.currentDate = currentDate;
        }

        public int getObjectId() {
            return objectId;
        }

        public void setObjectId(int objectId) {
            this.objectId = objectId;
        }

        public List<ListBean> getList() {
            return list;
        }

        public void setList(List<ListBean> list) {
            this.list = list;
        }

        public static class ListBean {
            /**
             * cmcid : 187915
             * threadCount : 0
             * id : 2946604
             * name : 焕采无瑕精华乳
             * title : 修丽可焕采无瑕精华乳
             * func : 美白淡斑,保湿
             * price : 780.00
             * pic : http://img.ilikelabs.com//Uploads/218/218524_0-600-600@0e_500w_500h_1c_0i_1o_1x.jpg
             * usedNum : 0
             * likedCount : 4
             * security : -1
             * brand : 5621
             * activeTime : 2016-12-20 06:00:00
             * suitableSkin : ["0000","0003","0030","0033","0100","0103","0130","0133","1000","1003","1030","1033","1100","1103","1130","1133","2000","2003","2030","2033","2100","2103","2130","2133","3000","3003","3030","3033","3100","3103","3130","3133"]
             * skinSuggestion : {"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":false,"sensitiveHeavy":false}
             * skinSuggestionApplied : true
             * recommendSkin : [""]
             * reviewCount : 0
             * reviewScore : 0.0
             * star : 0
             * brandChinaName : 修丽可
             * brandEnName : SKIN CEUTICALS
             * effectAbstract : 修丽可-SKINCEUTICALS欧莱雅集团旗下的品牌，网上也被叫做杜克。品牌源自美国，有浓厚的医学背景，在中国通常会在高端美容院或者医院销售，价格也比较高，当然也可以从官方旗舰店购买。修丽可焕采无瑕精华乳是一款美白祛斑产品，产品的保湿成分有多元醇、合成酯、硅油等，保湿性好，质地不厚重。含多种美白成分，并且每个美白成分都从不同层面帮助抗击黑色素：1.水杨酸0.3%：促进角质剥脱，可加快色斑部位的角质更新速度。2.鞣花酸0.5%：可抑制酪氨酸酶活性，从源头抑制黑色素生成，从而美白祛斑。3.具有美白作用的植物成分：向日葵籽提取物+光果甘草根提取物+杏叶提取物。厂家宣称薄荷提取物、酵母提取物也辅助了美白作用，不过还待笔者考证。整体来看，美白祛斑作用有，但不是很强，没有同品牌的美白精华作用强，需要长期使用才能看出效果。
             */

            private int cmcid;
            private int threadCount;
            private int id;
            private String name;
            private String title;
            private String func;
            private String price;
            private String pic;
            private int usedNum;
            private int likedCount;
            private int security;
            private String brand;
            private String activeTime;
            private SkinSuggestionBean skinSuggestion;
            private boolean skinSuggestionApplied;
            private int reviewCount;
            private String reviewScore;
            private int star;
            private String brandChinaName;
            private String brandEnName;
            private String effectAbstract;
            private List<String> suitableSkin;
            private List<String> recommendSkin;

            public int getCmcid() {
                return cmcid;
            }

            public void setCmcid(int cmcid) {
                this.cmcid = cmcid;
            }

            public int getThreadCount() {
                return threadCount;
            }

            public void setThreadCount(int threadCount) {
                this.threadCount = threadCount;
            }

            public int getId() {
                return id;
            }

            public void setId(int id) {
                this.id = id;
            }

            public String getName() {
                return name;
            }

            public void setName(String name) {
                this.name = name;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getFunc() {
                return func;
            }

            public void setFunc(String func) {
                this.func = func;
            }

            public String getPrice() {
                return price;
            }

            public void setPrice(String price) {
                this.price = price;
            }

            public String getPic() {
                return pic;
            }

            public void setPic(String pic) {
                this.pic = pic;
            }

            public int getUsedNum() {
                return usedNum;
            }

            public void setUsedNum(int usedNum) {
                this.usedNum = usedNum;
            }

            public int getLikedCount() {
                return likedCount;
            }

            public void setLikedCount(int likedCount) {
                this.likedCount = likedCount;
            }

            public int getSecurity() {
                return security;
            }

            public void setSecurity(int security) {
                this.security = security;
            }

            public String getBrand() {
                return brand;
            }

            public void setBrand(String brand) {
                this.brand = brand;
            }

            public String getActiveTime() {
                return activeTime;
            }

            public void setActiveTime(String activeTime) {
                this.activeTime = activeTime;
            }

            public SkinSuggestionBean getSkinSuggestion() {
                return skinSuggestion;
            }

            public void setSkinSuggestion(SkinSuggestionBean skinSuggestion) {
                this.skinSuggestion = skinSuggestion;
            }

            public boolean isSkinSuggestionApplied() {
                return skinSuggestionApplied;
            }

            public void setSkinSuggestionApplied(boolean skinSuggestionApplied) {
                this.skinSuggestionApplied = skinSuggestionApplied;
            }

            public int getReviewCount() {
                return reviewCount;
            }

            public void setReviewCount(int reviewCount) {
                this.reviewCount = reviewCount;
            }

            public String getReviewScore() {
                return reviewScore;
            }

            public void setReviewScore(String reviewScore) {
                this.reviewScore = reviewScore;
            }

            public int getStar() {
                return star;
            }

            public void setStar(int star) {
                this.star = star;
            }

            public String getBrandChinaName() {
                return brandChinaName;
            }

            public void setBrandChinaName(String brandChinaName) {
                this.brandChinaName = brandChinaName;
            }

            public String getBrandEnName() {
                return brandEnName;
            }

            public void setBrandEnName(String brandEnName) {
                this.brandEnName = brandEnName;
            }

            public String getEffectAbstract() {
                return effectAbstract;
            }

            public void setEffectAbstract(String effectAbstract) {
                this.effectAbstract = effectAbstract;
            }

            public List<String> getSuitableSkin() {
                return suitableSkin;
            }

            public void setSuitableSkin(List<String> suitableSkin) {
                this.suitableSkin = suitableSkin;
            }

            public List<String> getRecommendSkin() {
                return recommendSkin;
            }

            public void setRecommendSkin(List<String> recommendSkin) {
                this.recommendSkin = recommendSkin;
            }

            public static class SkinSuggestionBean {
                /**
                 * dryHeavy : true
                 * dryLight : true
                 * oilLight : true
                 * oilHeavy : true
                 * toleranceHeavy : true
                 * toleranceLight : true
                 * sensitiveLight : false
                 * sensitiveHeavy : false
                 */

                private boolean dryHeavy;
                private boolean dryLight;
                private boolean oilLight;
                private boolean oilHeavy;
                private boolean toleranceHeavy;
                private boolean toleranceLight;
                private boolean sensitiveLight;
                private boolean sensitiveHeavy;

                public boolean isDryHeavy() {
                    return dryHeavy;
                }

                public void setDryHeavy(boolean dryHeavy) {
                    this.dryHeavy = dryHeavy;
                }

                public boolean isDryLight() {
                    return dryLight;
                }

                public void setDryLight(boolean dryLight) {
                    this.dryLight = dryLight;
                }

                public boolean isOilLight() {
                    return oilLight;
                }

                public void setOilLight(boolean oilLight) {
                    this.oilLight = oilLight;
                }

                public boolean isOilHeavy() {
                    return oilHeavy;
                }

                public void setOilHeavy(boolean oilHeavy) {
                    this.oilHeavy = oilHeavy;
                }

                public boolean isToleranceHeavy() {
                    return toleranceHeavy;
                }

                public void setToleranceHeavy(boolean toleranceHeavy) {
                    this.toleranceHeavy = toleranceHeavy;
                }

                public boolean isToleranceLight() {
                    return toleranceLight;
                }

                public void setToleranceLight(boolean toleranceLight) {
                    this.toleranceLight = toleranceLight;
                }

                public boolean isSensitiveLight() {
                    return sensitiveLight;
                }

                public void setSensitiveLight(boolean sensitiveLight) {
                    this.sensitiveLight = sensitiveLight;
                }

                public boolean isSensitiveHeavy() {
                    return sensitiveHeavy;
                }

                public void setSensitiveHeavy(boolean sensitiveHeavy) {
                    this.sensitiveHeavy = sensitiveHeavy;
                }
            }
        }
    }
}
