package com.zhanghao.skinexpert.beans;

import java.io.Serializable;
import java.util.List;

/**
 * Created by 黑曼巴ye on 2016/12/22.
 */

public class ProductDetailBean implements Serializable {

    /**
     * error_code : 0
     * message : 成功
     * data : {"product":{"id":2930886,"name":"清痘净颜精华露","brand":"美肤家","price":"149.00","pic":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@0e_500w_500h_1c_0i_1o_1x.jpg","createTime":"2016-06-06 13:53:16","status":0,"marketPrice":"","location":"北京","specification":"30g","title":"美肤家清痘净颜精华露","subTitle":"","shelflife":"3年","sunscreen":1,"collectionNum":3632,"applySkinSuggestionCount":1708,"applySkinSuggestionResult":2,"character":"啫喱状","series":"","createBy":"1572","security":-1,"speAndPrice":[{"spe":"30g","price":"149.00","special_price":0}],"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"elementListSource":"药监备案+产品标签","taobao_url":"","taobao_price":"","taobao_source":0,"itemCount":0,"unsuitedCrowd":[],"funcArr":[{"id":27,"name":"控油"},{"id":50,"name":"祛痘"},{"id":145,"name":"抗菌消炎"},{"id":170,"name":"抗敏"}],"selectedComment":[],"brandIcon":"","description":"","community":[{"sortID":"266092","id":157735,"tags":[],"content":"一个都快用完了，然而并没卵用。。。痘痘还在长啊","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-20 10:11:21","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaGiadF08Oubg1BvKONTWibjA0EHn7gHEXdujInEjIOxXFG4jAR2nErmVia2wH1kzmyQI1ib6zsQnHqk9VQsDkscy6vD/0","nick":"葛利娟","uid":386756,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹","skin":"轻油-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"265293","id":157691,"tags":[],"content":"客服没人理，给了钱不发货，退款没人处理，垃圾APP,大家不要上当了！😡","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-15 13:46:54","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/ajNVdqHZLLDyjOarCOUMa7A9bJG5I6v5bfiaNt8Vxjwmrca9VZ0BWZKXyx03SISyNrI7Frc46rOAicibQpyUd8Aqw/0","nick":"妄斷彌空","uid":355043,"userType":"user","skinText":"轻油·重敏·非色素·皱纹","skin":"轻油-重敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"264898","id":157678,"tags":[],"content":"额，请问可以当乳液用吗？","categoryType":"product","image":[],"likedCount":1,"commentCount":1,"createTime":"2016-12-13 22:12:15","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"不可以，涂了很干燥","userType":"user"}],"user":{"headface":"http://img.ilikelabs.com/Uploads/214/214341_0-440-440.jpg","nick":"梨汝","uid":341839,"userType":"user","skinText":"轻油·重耐·非色素·紧致","skin":"轻油-重耐-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"264882","id":157661,"tags":[],"content":"大概几天发货啊？客服怎么不理我","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-12 09:02:44","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaEvibibfj0OdRDOeL3CAEEJ4ISSx5cXwmc8NPQn6v9ClddIM1Swd63xodWgMVUPph6rR4KBibhf05ia8A/0","nick":"胡慢慢吧","uid":378838,"userType":"user","skinText":"轻干·轻敏·非色素·皱纹","skin":"轻干-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"263691","id":157434,"tags":[],"content":"同问 怎么买","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-05 19:41:05","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/FZbe40rMUVjJL0P8nH5XerR6PMU86Q7ibneGoWfj814e0T3uuTkxVLLXnntxzHpLHBJ6NBhepqSMoic6Ucynh2kdsXUQLe77Wib/0","nick":"爱简单但相信太难","uid":383589,"userType":"user","skinText":"轻干·轻敏·非色素·紧致","skin":"轻干-轻敏-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"262904","id":157398,"tags":[],"content":"居然淘宝找不到 🌝","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-12-02 23:35:29","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/FZbe40rMUVhzuX9QibLL1ibASSaPeukM7Nv82aZOjBibOicCDn8qDnCbswtGbcnjqwyxQVngsibLZmQgOibvlCClr7cicWdMx7k9HjW/0","nick":"O.LIVI","uid":364300,"userType":"user","skinText":"轻油·重敏·非色素·紧致","skin":"轻油-重敏-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"262887","id":157397,"tags":[],"content":"真的好用吗？实话","categoryType":"product","image":[],"likedCount":0,"commentCount":2,"createTime":"2016-12-02 22:59:11","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"没什么效果，真的","userType":"user"},{"nick":"橡皮泥娃娃","onick":"","content":"好用","userType":"user"}],"user":{"headface":"http://tva1.sinaimg.cn/crop.0.0.664.664.50/006c0xK6jw8f6fwfaz871j30ig0igjsf.jpg","nick":"芮女啦","uid":379537,"userType":"user","skinText":"重油·重耐·非色素·紧致","skin":"重油-重耐-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"261717","id":157349,"tags":[],"content":"我想用美肤家买东西，怎么买的？？","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-30 13:13:54","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/rK4iaib8uYt1W6pJU8TEjd1tzIMZXSicILvicmQmNFPiasqGKcbhKfUWmrvnicPnOZcLxwN91ibDq3jqIKoeQ4UpJKepxJYgwVp4Dlc/0","nick":"忆时","uid":325435,"userType":"user","skinText":"轻油·轻敏·非色素·紧致","skin":"轻油-轻敏-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"260873","id":157302,"tags":[],"content":"在哪买啊？？？急","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-26 17:22:11","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://tva3.sinaimg.cn/crop.0.0.996.996.50/005BGYUBjw8f9gaybcvulj30ro0roaap.jpg","nick":"YUN嚴","uid":370477,"userType":"user","skinText":"轻油·轻耐·非色素·皱纹","skin":"轻油-轻耐-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"260106","id":157284,"tags":[],"content":"在哪买啊","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-11-24 21:28:20","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/XCopLcwfzedp88yCFE9Nr4R8H4J6MfcEibh23ric3Uxx3hicjXibzrejTKShOyeczztyiatAB4Yibob45o7TXNoyVd2HzKdCMd3mibJ/0","nick":"Moster","uid":366125,"userType":"user","skinText":"重油·轻敏·非色素·皱纹","skin":"重油-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"259676","id":157273,"tags":[],"content":"为什么买不了啊？","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-23 20:19:33","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://img.ilikelabs.com/Uploads/140/140130_0-180-180","nick":"wy","uid":375506,"userType":"user","skinText":"重油·重耐·非色素·紧致","skin":"重油-重耐-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"259091","id":157199,"tags":[],"content":"这在哪买呢","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-11-18 15:10:10","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://tp2.sinaimg.cn/2233290633/180/5605059092/0","nick":"情情情情情儿","uid":247607,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹","skin":"轻油-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"258214","id":157156,"tags":[],"content":"请问\u201c美肤家清痘净颜精华露\u201d在哪里能买到？","categoryType":"product","image":[],"likedCount":3,"commentCount":0,"createTime":"2016-11-16 00:07:50","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/dwPBeb42grIqlpjqTpe9tia8DWPVNGictiahOI3CMiaYB32EgGkILTEQs5xibvpTcfG7ecQxBuBnPmh6Oau3GOQW8DOOHRW5ytqGN/0","nick":"橘子君","uid":340951,"userType":"user","skinText":"轻油·重敏·非色素·皱纹","skin":"轻油-重敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"256731","id":157073,"tags":[],"content":"真的有用吗，可以祛痘印吗😊","categoryType":"product","image":[],"likedCount":2,"commentCount":1,"createTime":"2016-11-12 18:51:10","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"不可以去痘印对痘痘也不怎么有效果","userType":"user"}],"user":{"headface":"http://tva2.sinaimg.cn/crop.0.0.996.996.50/0069MJzJjw8f71av8m7duj30ro0rognj.jpg","nick":"易人light","uid":374455,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹","skin":"轻油-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"256156","id":157055,"tags":[],"content":"咋买","categoryType":"product","image":[],"likedCount":3,"commentCount":0,"createTime":"2016-11-10 18:16:58","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/ajNVdqHZLLAuBgnPkTibLBaH4nwUFIXpiaWvKvSuTCnf6cJGibI9kZqgaNC4wm7RVKrgsJWM3btF3BxDVeZOjRtKg/0","nick":"樊志尧","uid":317417,"userType":"user","skinText":"轻干·重耐·非色素·皱纹","skin":"轻干-重耐-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"255504","id":157013,"tags":[],"content":"请问孕妇可以用吗？怀孕七个月脸上长了很多痘痘","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-08 12:23:54","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/XCopLcwfzecPyOpHIVW0agOfckv2I1Heo210l8ceVNxX3nZED31UcyGQOM8QuYLtWJ5B6mMr3YXrBcicoZ9dpmQ/0","nick":"二当家","uid":78087,"userType":"user","skinText":"轻油·重敏·非色素·紧致","skin":"轻油-重敏-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"255405","id":157004,"tags":[],"content":"怎么不好买","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-07 20:38:52","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://img.ilikelabs.com/Uploads/165/165589_0-320-320.jpg","nick":"功夫兔","uid":126122,"userType":"user","skinText":"轻油·轻耐·非色素·皱纹","skin":"轻油-轻耐-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"255280","id":156987,"tags":[],"content":"我就想知道怎么买","categoryType":"product","image":[],"likedCount":2,"commentCount":2,"createTime":"2016-11-06 16:15:03","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"zii","onick":"","content":"微店有链接吗？","userType":"user"},{"nick":"小舟Myra","onick":"","content":"这个是在美肤家微店卖的","userType":"user"}],"user":{"headface":"http://img.ilikelabs.com/Uploads/140/140130_0-180-180","nick":"MFJ65087","uid":371367,"userType":"user","skinText":"轻干·重敏·非色素·皱纹","skin":"轻干-重敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"253688","id":156921,"tags":[],"content":"我也想买啊，脸都快毁了，痛苦啊","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-03 20:24:26","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/rK4iaib8uYt1XvcPeialckOsTlo8BTCtibBEgy41W5e7F2UibicEGGTJ4JrHPUP1ia3UcU4sNGuYjzbEshYG1qBr5PbTCAQO5NQpPnn/0","nick":"无根的浮萍","uid":369611,"userType":"user","skinText":"重油·重敏·非色素·皱纹","skin":"重油-重敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"252685","id":156855,"tags":[],"content":"我怎么买不了","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-10-31 09:33:15","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/Q3auHgzwzM7COI8Aaqjwnol2ly9lEic1473zcQmJnWl18tZejqibMOHzBPSKefMjB0AtibYE2jiaVf0b1tP3ZqViaiatsnWwwQFSqXC8ro2A76O88/0","nick":"文","uid":364854,"userType":"user","skinText":"轻油·轻耐·非色素·紧致","skin":"轻油-轻耐-非色素-紧致"},"product":[],"subscribed":false}],"isUsed":false,"review_star":0,"review_text":"","howUseObject":[{"tip":"","detail":""}],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"applySkinSuggestionCredit":0,"OilDryDesc":"干性、油性肤质长痘时均可使用，油性肤质可日常使用。","SensitiveDesc":"不含香精，防腐体系采用比较温和的苯氧乙醇。","skinMatchApplied":false,"isOnSale":1,"buy_specifications":"30g","buy_price_original":"149.00","buy_price":"99.00","buyout_id":"100174","buy_product_source":0,"buy_refund_policy":7,"buy_shipping_cost":0,"buy_preorder":0,"buy_preorderText":"","maxDiscount":0,"product_vote_score":8.7,"product_vote_count":91,"discussNum":0,"tryoutApplied":false,"isSuitable":0,"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"productTryoutDate":"","productTryoutID":0,"pid":2930886,"skinDescription":"","effectAbstract":"从护肤品的角度探查，痤疮成因可以简化为4个字：多-堵-菌-炎。这4个成因是什么？\n\n\u201c多\u201d：首先要皮脂腺过度分泌，增加皮肤油腻程度。\n\u201c堵\u201d：毛囊局部角质细胞过度角化，互相粘连使毛孔开口处堵塞了。\n\u201c菌\u201d：基本是三种细菌在作怪。有喜欢油脂的细菌，有喜欢氧气的细菌。最常见的痤疮丙酸杆菌：喜欢脂肪同时厌氧。所以，毛孔从外到内它都存在。\n\u201c炎\u201d：皮脂与堆积的老化细胞混合，这种混合物接触空气氧化变黑就形成黑头粉刺，如果外表被角质层覆盖就形成白头粉刺。痤疮丙酸杆菌等细菌在油脂和死细胞中大量繁殖，最后造成皮肤炎症，发炎后就会形成脓包或玫瑰痤疮。\n\n这款美肤家祛痘精华露，摒弃了配方师习惯性采用的水杨酸、维生素A衍生物等原料，而是选用植物来源的功效成分，避免了传统的热门祛痘护理品虽然效果出众、然而痘痘源源不绝的现象。经过前期广泛的市场调查，对各种痘痘有不同程度的缓解。并且对油性肌肤具有调节油脂分泌的作用。\n\n功效成分排位第一位的是贯叶连翘提取物，它可以抑制弹性蛋白酶的活性，促进细胞增殖。配合其抗氧化的特性，能够增强皮肤细胞新陈代谢。\n\n北美金缕梅叶提取物通过抑制脂肪酶活性和游离组织胺释放，达到抗炎和抑制过敏的作用。\n\n锈红蔷薇籽油能够抑制脂质过氧化。同时它能够缓解红血丝和痘肌的发红肌肤。\n\n母菊花提取物对巨噬细胞极强的激活作用。它额外的优点是可以收缩毛孔。\n\n马齿苋提取物抑制脂氧合酶的活性，可以促进脂肪分解。\n\n综上所述，功效成分的配合运用，不仅解决了4种痤疮成因的内在源头，还在美白、保湿、抗氧化、抗衰老、抑制过敏、抗炎、缓解发红、收缩毛孔、调节油脂分泌等细节处做到了尽善尽美。\n\n这款精华露的载体使用了啫喱的体系，避免油分原料对油脂分泌的激发。\n\n不含香精。含有防腐剂苯氧乙醇。防腐体系比较温和。","effectDescription":"","effectDescriptionAudio":"","effectTips":"关于痘痘的统计数据：\n\n对于流行病学的调查，西方普遍认同的统计数据：80%的青少年在青春期面部都有痤疮，人们往往称之为青春痘。等到过了青春期，50%的人群痤疮没有消失。这里面的相当一部分人群，到了44岁，仍然有痤疮症状。\n\n北京市2005年在中学生中所做的流行病学调查显示：44.5%的青少年患有痤疮。\n\n皮肤科学界的观点是，痤疮是一种疾病，是\u201c毛囊皮脂腺的疾病，而且是慢性炎症。\u201d","crowdAbstract":"","crowdDescription":"","elementSecurityTip":{"securityTip":"","baseTip":""},"elementValidFuncGroup":"[{\"funcId\":81,\"els\":[1240,2253]},{\"funcId\":65,\"els\":[1240,4297,1800]},{\"funcId\":87,\"els\":[1108]},{\"funcId\":80,\"els\":[1108]},{\"funcId\":85,\"els\":[1108]},{\"funcId\":84,\"els\":[4297]},{\"funcId\":86,\"els\":[2253]},{\"funcId\":121,\"els\":[2253]},{\"funcId\":66,\"els\":[2253]},{\"funcId\":71,\"els\":[2253]},{\"funcId\":159,\"els\":[2253]},{\"funcId\":78,\"els\":[1290]},{\"funcId\":152,\"els\":[1290]}]","uid":121377,"userExpert":"化妆品配方工程师","nick":"Jane","headface":"http://img.ilikelabs.com/Uploads/172/172255_0-140-140@200w_1x.jpg"},"isRequestedRead":true,"requestReadCount":0}
     */

    private int error_code;
    private String message;
    private DataBean data;

    public int getError_code() {
        return error_code;
    }

    public void setError_code(int error_code) {
        this.error_code = error_code;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    @Override
    public String toString() {
        return "ProductDetailBean{" +
                "error_code=" + error_code +
                ", message='" + message + '\'' +
                ", data=" + data +
                '}';
    }

    public static class DataBean implements Serializable{
        /**
         * product : {"id":2930886,"name":"清痘净颜精华露","brand":"美肤家","price":"149.00","pic":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@0e_500w_500h_1c_0i_1o_1x.jpg","createTime":"2016-06-06 13:53:16","status":0,"marketPrice":"","location":"北京","specification":"30g","title":"美肤家清痘净颜精华露","subTitle":"","shelflife":"3年","sunscreen":1,"collectionNum":3632,"applySkinSuggestionCount":1708,"applySkinSuggestionResult":2,"character":"啫喱状","series":"","createBy":"1572","security":-1,"speAndPrice":[{"spe":"30g","price":"149.00","special_price":0}],"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"elementListSource":"药监备案+产品标签","taobao_url":"","taobao_price":"","taobao_source":0,"itemCount":0,"unsuitedCrowd":[],"funcArr":[{"id":27,"name":"控油"},{"id":50,"name":"祛痘"},{"id":145,"name":"抗菌消炎"},{"id":170,"name":"抗敏"}],"selectedComment":[],"brandIcon":"","description":"","community":[{"sortID":"266092","id":157735,"tags":[],"content":"一个都快用完了，然而并没卵用。。。痘痘还在长啊","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-20 10:11:21","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaGiadF08Oubg1BvKONTWibjA0EHn7gHEXdujInEjIOxXFG4jAR2nErmVia2wH1kzmyQI1ib6zsQnHqk9VQsDkscy6vD/0","nick":"葛利娟","uid":386756,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹","skin":"轻油-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"265293","id":157691,"tags":[],"content":"客服没人理，给了钱不发货，退款没人处理，垃圾APP,大家不要上当了！😡","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-15 13:46:54","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/ajNVdqHZLLDyjOarCOUMa7A9bJG5I6v5bfiaNt8Vxjwmrca9VZ0BWZKXyx03SISyNrI7Frc46rOAicibQpyUd8Aqw/0","nick":"妄斷彌空","uid":355043,"userType":"user","skinText":"轻油·重敏·非色素·皱纹","skin":"轻油-重敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"264898","id":157678,"tags":[],"content":"额，请问可以当乳液用吗？","categoryType":"product","image":[],"likedCount":1,"commentCount":1,"createTime":"2016-12-13 22:12:15","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"不可以，涂了很干燥","userType":"user"}],"user":{"headface":"http://img.ilikelabs.com/Uploads/214/214341_0-440-440.jpg","nick":"梨汝","uid":341839,"userType":"user","skinText":"轻油·重耐·非色素·紧致","skin":"轻油-重耐-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"264882","id":157661,"tags":[],"content":"大概几天发货啊？客服怎么不理我","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-12 09:02:44","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaEvibibfj0OdRDOeL3CAEEJ4ISSx5cXwmc8NPQn6v9ClddIM1Swd63xodWgMVUPph6rR4KBibhf05ia8A/0","nick":"胡慢慢吧","uid":378838,"userType":"user","skinText":"轻干·轻敏·非色素·皱纹","skin":"轻干-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"263691","id":157434,"tags":[],"content":"同问 怎么买","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-05 19:41:05","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/FZbe40rMUVjJL0P8nH5XerR6PMU86Q7ibneGoWfj814e0T3uuTkxVLLXnntxzHpLHBJ6NBhepqSMoic6Ucynh2kdsXUQLe77Wib/0","nick":"爱简单但相信太难","uid":383589,"userType":"user","skinText":"轻干·轻敏·非色素·紧致","skin":"轻干-轻敏-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"262904","id":157398,"tags":[],"content":"居然淘宝找不到 🌝","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-12-02 23:35:29","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/FZbe40rMUVhzuX9QibLL1ibASSaPeukM7Nv82aZOjBibOicCDn8qDnCbswtGbcnjqwyxQVngsibLZmQgOibvlCClr7cicWdMx7k9HjW/0","nick":"O.LIVI","uid":364300,"userType":"user","skinText":"轻油·重敏·非色素·紧致","skin":"轻油-重敏-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"262887","id":157397,"tags":[],"content":"真的好用吗？实话","categoryType":"product","image":[],"likedCount":0,"commentCount":2,"createTime":"2016-12-02 22:59:11","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"没什么效果，真的","userType":"user"},{"nick":"橡皮泥娃娃","onick":"","content":"好用","userType":"user"}],"user":{"headface":"http://tva1.sinaimg.cn/crop.0.0.664.664.50/006c0xK6jw8f6fwfaz871j30ig0igjsf.jpg","nick":"芮女啦","uid":379537,"userType":"user","skinText":"重油·重耐·非色素·紧致","skin":"重油-重耐-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"261717","id":157349,"tags":[],"content":"我想用美肤家买东西，怎么买的？？","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-30 13:13:54","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/rK4iaib8uYt1W6pJU8TEjd1tzIMZXSicILvicmQmNFPiasqGKcbhKfUWmrvnicPnOZcLxwN91ibDq3jqIKoeQ4UpJKepxJYgwVp4Dlc/0","nick":"忆时","uid":325435,"userType":"user","skinText":"轻油·轻敏·非色素·紧致","skin":"轻油-轻敏-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"260873","id":157302,"tags":[],"content":"在哪买啊？？？急","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-26 17:22:11","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://tva3.sinaimg.cn/crop.0.0.996.996.50/005BGYUBjw8f9gaybcvulj30ro0roaap.jpg","nick":"YUN嚴","uid":370477,"userType":"user","skinText":"轻油·轻耐·非色素·皱纹","skin":"轻油-轻耐-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"260106","id":157284,"tags":[],"content":"在哪买啊","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-11-24 21:28:20","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/XCopLcwfzedp88yCFE9Nr4R8H4J6MfcEibh23ric3Uxx3hicjXibzrejTKShOyeczztyiatAB4Yibob45o7TXNoyVd2HzKdCMd3mibJ/0","nick":"Moster","uid":366125,"userType":"user","skinText":"重油·轻敏·非色素·皱纹","skin":"重油-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"259676","id":157273,"tags":[],"content":"为什么买不了啊？","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-23 20:19:33","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://img.ilikelabs.com/Uploads/140/140130_0-180-180","nick":"wy","uid":375506,"userType":"user","skinText":"重油·重耐·非色素·紧致","skin":"重油-重耐-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"259091","id":157199,"tags":[],"content":"这在哪买呢","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-11-18 15:10:10","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://tp2.sinaimg.cn/2233290633/180/5605059092/0","nick":"情情情情情儿","uid":247607,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹","skin":"轻油-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"258214","id":157156,"tags":[],"content":"请问\u201c美肤家清痘净颜精华露\u201d在哪里能买到？","categoryType":"product","image":[],"likedCount":3,"commentCount":0,"createTime":"2016-11-16 00:07:50","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/dwPBeb42grIqlpjqTpe9tia8DWPVNGictiahOI3CMiaYB32EgGkILTEQs5xibvpTcfG7ecQxBuBnPmh6Oau3GOQW8DOOHRW5ytqGN/0","nick":"橘子君","uid":340951,"userType":"user","skinText":"轻油·重敏·非色素·皱纹","skin":"轻油-重敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"256731","id":157073,"tags":[],"content":"真的有用吗，可以祛痘印吗😊","categoryType":"product","image":[],"likedCount":2,"commentCount":1,"createTime":"2016-11-12 18:51:10","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"不可以去痘印对痘痘也不怎么有效果","userType":"user"}],"user":{"headface":"http://tva2.sinaimg.cn/crop.0.0.996.996.50/0069MJzJjw8f71av8m7duj30ro0rognj.jpg","nick":"易人light","uid":374455,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹","skin":"轻油-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"256156","id":157055,"tags":[],"content":"咋买","categoryType":"product","image":[],"likedCount":3,"commentCount":0,"createTime":"2016-11-10 18:16:58","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/ajNVdqHZLLAuBgnPkTibLBaH4nwUFIXpiaWvKvSuTCnf6cJGibI9kZqgaNC4wm7RVKrgsJWM3btF3BxDVeZOjRtKg/0","nick":"樊志尧","uid":317417,"userType":"user","skinText":"轻干·重耐·非色素·皱纹","skin":"轻干-重耐-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"255504","id":157013,"tags":[],"content":"请问孕妇可以用吗？怀孕七个月脸上长了很多痘痘","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-08 12:23:54","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/XCopLcwfzecPyOpHIVW0agOfckv2I1Heo210l8ceVNxX3nZED31UcyGQOM8QuYLtWJ5B6mMr3YXrBcicoZ9dpmQ/0","nick":"二当家","uid":78087,"userType":"user","skinText":"轻油·重敏·非色素·紧致","skin":"轻油-重敏-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"255405","id":157004,"tags":[],"content":"怎么不好买","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-07 20:38:52","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://img.ilikelabs.com/Uploads/165/165589_0-320-320.jpg","nick":"功夫兔","uid":126122,"userType":"user","skinText":"轻油·轻耐·非色素·皱纹","skin":"轻油-轻耐-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"255280","id":156987,"tags":[],"content":"我就想知道怎么买","categoryType":"product","image":[],"likedCount":2,"commentCount":2,"createTime":"2016-11-06 16:15:03","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"zii","onick":"","content":"微店有链接吗？","userType":"user"},{"nick":"小舟Myra","onick":"","content":"这个是在美肤家微店卖的","userType":"user"}],"user":{"headface":"http://img.ilikelabs.com/Uploads/140/140130_0-180-180","nick":"MFJ65087","uid":371367,"userType":"user","skinText":"轻干·重敏·非色素·皱纹","skin":"轻干-重敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"253688","id":156921,"tags":[],"content":"我也想买啊，脸都快毁了，痛苦啊","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-03 20:24:26","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/rK4iaib8uYt1XvcPeialckOsTlo8BTCtibBEgy41W5e7F2UibicEGGTJ4JrHPUP1ia3UcU4sNGuYjzbEshYG1qBr5PbTCAQO5NQpPnn/0","nick":"无根的浮萍","uid":369611,"userType":"user","skinText":"重油·重敏·非色素·皱纹","skin":"重油-重敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"252685","id":156855,"tags":[],"content":"我怎么买不了","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-10-31 09:33:15","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/Q3auHgzwzM7COI8Aaqjwnol2ly9lEic1473zcQmJnWl18tZejqibMOHzBPSKefMjB0AtibYE2jiaVf0b1tP3ZqViaiatsnWwwQFSqXC8ro2A76O88/0","nick":"文","uid":364854,"userType":"user","skinText":"轻油·轻耐·非色素·紧致","skin":"轻油-轻耐-非色素-紧致"},"product":[],"subscribed":false}],"isUsed":false,"review_star":0,"review_text":"","howUseObject":[{"tip":"","detail":""}],"skinSuggestion":{"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true},"applySkinSuggestionCredit":0,"OilDryDesc":"干性、油性肤质长痘时均可使用，油性肤质可日常使用。","SensitiveDesc":"不含香精，防腐体系采用比较温和的苯氧乙醇。","skinMatchApplied":false,"isOnSale":1,"buy_specifications":"30g","buy_price_original":"149.00","buy_price":"99.00","buyout_id":"100174","buy_product_source":0,"buy_refund_policy":7,"buy_shipping_cost":0,"buy_preorder":0,"buy_preorderText":"","maxDiscount":0,"product_vote_score":8.7,"product_vote_count":91,"discussNum":0,"tryoutApplied":false,"isSuitable":0,"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"productTryoutDate":"","productTryoutID":0,"pid":2930886,"skinDescription":"","effectAbstract":"从护肤品的角度探查，痤疮成因可以简化为4个字：多-堵-菌-炎。这4个成因是什么？\n\n\u201c多\u201d：首先要皮脂腺过度分泌，增加皮肤油腻程度。\n\u201c堵\u201d：毛囊局部角质细胞过度角化，互相粘连使毛孔开口处堵塞了。\n\u201c菌\u201d：基本是三种细菌在作怪。有喜欢油脂的细菌，有喜欢氧气的细菌。最常见的痤疮丙酸杆菌：喜欢脂肪同时厌氧。所以，毛孔从外到内它都存在。\n\u201c炎\u201d：皮脂与堆积的老化细胞混合，这种混合物接触空气氧化变黑就形成黑头粉刺，如果外表被角质层覆盖就形成白头粉刺。痤疮丙酸杆菌等细菌在油脂和死细胞中大量繁殖，最后造成皮肤炎症，发炎后就会形成脓包或玫瑰痤疮。\n\n这款美肤家祛痘精华露，摒弃了配方师习惯性采用的水杨酸、维生素A衍生物等原料，而是选用植物来源的功效成分，避免了传统的热门祛痘护理品虽然效果出众、然而痘痘源源不绝的现象。经过前期广泛的市场调查，对各种痘痘有不同程度的缓解。并且对油性肌肤具有调节油脂分泌的作用。\n\n功效成分排位第一位的是贯叶连翘提取物，它可以抑制弹性蛋白酶的活性，促进细胞增殖。配合其抗氧化的特性，能够增强皮肤细胞新陈代谢。\n\n北美金缕梅叶提取物通过抑制脂肪酶活性和游离组织胺释放，达到抗炎和抑制过敏的作用。\n\n锈红蔷薇籽油能够抑制脂质过氧化。同时它能够缓解红血丝和痘肌的发红肌肤。\n\n母菊花提取物对巨噬细胞极强的激活作用。它额外的优点是可以收缩毛孔。\n\n马齿苋提取物抑制脂氧合酶的活性，可以促进脂肪分解。\n\n综上所述，功效成分的配合运用，不仅解决了4种痤疮成因的内在源头，还在美白、保湿、抗氧化、抗衰老、抑制过敏、抗炎、缓解发红、收缩毛孔、调节油脂分泌等细节处做到了尽善尽美。\n\n这款精华露的载体使用了啫喱的体系，避免油分原料对油脂分泌的激发。\n\n不含香精。含有防腐剂苯氧乙醇。防腐体系比较温和。","effectDescription":"","effectDescriptionAudio":"","effectTips":"关于痘痘的统计数据：\n\n对于流行病学的调查，西方普遍认同的统计数据：80%的青少年在青春期面部都有痤疮，人们往往称之为青春痘。等到过了青春期，50%的人群痤疮没有消失。这里面的相当一部分人群，到了44岁，仍然有痤疮症状。\n\n北京市2005年在中学生中所做的流行病学调查显示：44.5%的青少年患有痤疮。\n\n皮肤科学界的观点是，痤疮是一种疾病，是\u201c毛囊皮脂腺的疾病，而且是慢性炎症。\u201d","crowdAbstract":"","crowdDescription":"","elementSecurityTip":{"securityTip":"","baseTip":""},"elementValidFuncGroup":"[{\"funcId\":81,\"els\":[1240,2253]},{\"funcId\":65,\"els\":[1240,4297,1800]},{\"funcId\":87,\"els\":[1108]},{\"funcId\":80,\"els\":[1108]},{\"funcId\":85,\"els\":[1108]},{\"funcId\":84,\"els\":[4297]},{\"funcId\":86,\"els\":[2253]},{\"funcId\":121,\"els\":[2253]},{\"funcId\":66,\"els\":[2253]},{\"funcId\":71,\"els\":[2253]},{\"funcId\":159,\"els\":[2253]},{\"funcId\":78,\"els\":[1290]},{\"funcId\":152,\"els\":[1290]}]","uid":121377,"userExpert":"化妆品配方工程师","nick":"Jane","headface":"http://img.ilikelabs.com/Uploads/172/172255_0-140-140@200w_1x.jpg"}
         * isRequestedRead : true
         * requestReadCount : 0
         */

        private ProductBean product;
        private boolean isRequestedRead;
        private int requestReadCount;

        public ProductBean getProduct() {
            return product;
        }

        public void setProduct(ProductBean product) {
            this.product = product;
        }

        public boolean isIsRequestedRead() {
            return isRequestedRead;
        }

        public void setIsRequestedRead(boolean isRequestedRead) {
            this.isRequestedRead = isRequestedRead;
        }

        public int getRequestReadCount() {
            return requestReadCount;
        }

        public void setRequestReadCount(int requestReadCount) {
            this.requestReadCount = requestReadCount;
        }

        @Override
        public String toString() {
            return "DataBean{" +
                    "product=" + product +
                    ", isRequestedRead=" + isRequestedRead +
                    ", requestReadCount=" + requestReadCount +
                    '}';
        }

        public static class ProductBean implements Serializable {

            /**
             * id : 2930886
             * name : 清痘净颜精华露
             * brand : 美肤家
             * price : 149.00
             * pic : http://img.ilikelabs.com//Uploads/208/208548_0-750-750@0e_500w_500h_1c_0i_1o_1x.jpg
             * createTime : 2016-06-06 13:53:16
             * status : 0
             * marketPrice :
             * location : 北京
             * specification : 30g
             * title : 美肤家清痘净颜精华露
             * subTitle :
             * shelflife : 3年
             * sunscreen : 1
             * collectionNum : 3632
             * applySkinSuggestionCount : 1708
             * applySkinSuggestionResult : 2
             * character : 啫喱状
             * series :
             * createBy : 1572
             * security : -1
             * speAndPrice : [{"spe":"30g","price":"149.00","special_price":0}]
             * suitableSkin : ["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]
             * elementListSource : 药监备案+产品标签
             * taobao_url :
             * taobao_price :
             * taobao_source : 0
             * itemCount : 0
             * unsuitedCrowd : []
             * funcArr : [{"id":27,"name":"控油"},{"id":50,"name":"祛痘"},{"id":145,"name":"抗菌消炎"},{"id":170,"name":"抗敏"}]
             * selectedComment : []
             * brandIcon :
             * description :
             * community : [{"sortID":"266092","id":157735,"tags":[],"content":"一个都快用完了，然而并没卵用。。。痘痘还在长啊","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-20 10:11:21","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaGiadF08Oubg1BvKONTWibjA0EHn7gHEXdujInEjIOxXFG4jAR2nErmVia2wH1kzmyQI1ib6zsQnHqk9VQsDkscy6vD/0","nick":"葛利娟","uid":386756,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹","skin":"轻油-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"265293","id":157691,"tags":[],"content":"客服没人理，给了钱不发货，退款没人处理，垃圾APP,大家不要上当了！😡","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-15 13:46:54","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/ajNVdqHZLLDyjOarCOUMa7A9bJG5I6v5bfiaNt8Vxjwmrca9VZ0BWZKXyx03SISyNrI7Frc46rOAicibQpyUd8Aqw/0","nick":"妄斷彌空","uid":355043,"userType":"user","skinText":"轻油·重敏·非色素·皱纹","skin":"轻油-重敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"264898","id":157678,"tags":[],"content":"额，请问可以当乳液用吗？","categoryType":"product","image":[],"likedCount":1,"commentCount":1,"createTime":"2016-12-13 22:12:15","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"不可以，涂了很干燥","userType":"user"}],"user":{"headface":"http://img.ilikelabs.com/Uploads/214/214341_0-440-440.jpg","nick":"梨汝","uid":341839,"userType":"user","skinText":"轻油·重耐·非色素·紧致","skin":"轻油-重耐-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"264882","id":157661,"tags":[],"content":"大概几天发货啊？客服怎么不理我","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-12 09:02:44","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaEvibibfj0OdRDOeL3CAEEJ4ISSx5cXwmc8NPQn6v9ClddIM1Swd63xodWgMVUPph6rR4KBibhf05ia8A/0","nick":"胡慢慢吧","uid":378838,"userType":"user","skinText":"轻干·轻敏·非色素·皱纹","skin":"轻干-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"263691","id":157434,"tags":[],"content":"同问 怎么买","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-12-05 19:41:05","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/FZbe40rMUVjJL0P8nH5XerR6PMU86Q7ibneGoWfj814e0T3uuTkxVLLXnntxzHpLHBJ6NBhepqSMoic6Ucynh2kdsXUQLe77Wib/0","nick":"爱简单但相信太难","uid":383589,"userType":"user","skinText":"轻干·轻敏·非色素·紧致","skin":"轻干-轻敏-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"262904","id":157398,"tags":[],"content":"居然淘宝找不到 🌝","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-12-02 23:35:29","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/FZbe40rMUVhzuX9QibLL1ibASSaPeukM7Nv82aZOjBibOicCDn8qDnCbswtGbcnjqwyxQVngsibLZmQgOibvlCClr7cicWdMx7k9HjW/0","nick":"O.LIVI","uid":364300,"userType":"user","skinText":"轻油·重敏·非色素·紧致","skin":"轻油-重敏-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"262887","id":157397,"tags":[],"content":"真的好用吗？实话","categoryType":"product","image":[],"likedCount":0,"commentCount":2,"createTime":"2016-12-02 22:59:11","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"没什么效果，真的","userType":"user"},{"nick":"橡皮泥娃娃","onick":"","content":"好用","userType":"user"}],"user":{"headface":"http://tva1.sinaimg.cn/crop.0.0.664.664.50/006c0xK6jw8f6fwfaz871j30ig0igjsf.jpg","nick":"芮女啦","uid":379537,"userType":"user","skinText":"重油·重耐·非色素·紧致","skin":"重油-重耐-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"261717","id":157349,"tags":[],"content":"我想用美肤家买东西，怎么买的？？","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-30 13:13:54","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/rK4iaib8uYt1W6pJU8TEjd1tzIMZXSicILvicmQmNFPiasqGKcbhKfUWmrvnicPnOZcLxwN91ibDq3jqIKoeQ4UpJKepxJYgwVp4Dlc/0","nick":"忆时","uid":325435,"userType":"user","skinText":"轻油·轻敏·非色素·紧致","skin":"轻油-轻敏-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"260873","id":157302,"tags":[],"content":"在哪买啊？？？急","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-26 17:22:11","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://tva3.sinaimg.cn/crop.0.0.996.996.50/005BGYUBjw8f9gaybcvulj30ro0roaap.jpg","nick":"YUN嚴","uid":370477,"userType":"user","skinText":"轻油·轻耐·非色素·皱纹","skin":"轻油-轻耐-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"260106","id":157284,"tags":[],"content":"在哪买啊","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-11-24 21:28:20","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/XCopLcwfzedp88yCFE9Nr4R8H4J6MfcEibh23ric3Uxx3hicjXibzrejTKShOyeczztyiatAB4Yibob45o7TXNoyVd2HzKdCMd3mibJ/0","nick":"Moster","uid":366125,"userType":"user","skinText":"重油·轻敏·非色素·皱纹","skin":"重油-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"259676","id":157273,"tags":[],"content":"为什么买不了啊？","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-23 20:19:33","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://img.ilikelabs.com/Uploads/140/140130_0-180-180","nick":"wy","uid":375506,"userType":"user","skinText":"重油·重耐·非色素·紧致","skin":"重油-重耐-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"259091","id":157199,"tags":[],"content":"这在哪买呢","categoryType":"product","image":[],"likedCount":1,"commentCount":0,"createTime":"2016-11-18 15:10:10","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://tp2.sinaimg.cn/2233290633/180/5605059092/0","nick":"情情情情情儿","uid":247607,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹","skin":"轻油-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"258214","id":157156,"tags":[],"content":"请问\u201c美肤家清痘净颜精华露\u201d在哪里能买到？","categoryType":"product","image":[],"likedCount":3,"commentCount":0,"createTime":"2016-11-16 00:07:50","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/dwPBeb42grIqlpjqTpe9tia8DWPVNGictiahOI3CMiaYB32EgGkILTEQs5xibvpTcfG7ecQxBuBnPmh6Oau3GOQW8DOOHRW5ytqGN/0","nick":"橘子君","uid":340951,"userType":"user","skinText":"轻油·重敏·非色素·皱纹","skin":"轻油-重敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"256731","id":157073,"tags":[],"content":"真的有用吗，可以祛痘印吗😊","categoryType":"product","image":[],"likedCount":2,"commentCount":1,"createTime":"2016-11-12 18:51:10","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"so 酷 ","onick":"","content":"不可以去痘印对痘痘也不怎么有效果","userType":"user"}],"user":{"headface":"http://tva2.sinaimg.cn/crop.0.0.996.996.50/0069MJzJjw8f71av8m7duj30ro0rognj.jpg","nick":"易人light","uid":374455,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹","skin":"轻油-轻敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"256156","id":157055,"tags":[],"content":"咋买","categoryType":"product","image":[],"likedCount":3,"commentCount":0,"createTime":"2016-11-10 18:16:58","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/ajNVdqHZLLAuBgnPkTibLBaH4nwUFIXpiaWvKvSuTCnf6cJGibI9kZqgaNC4wm7RVKrgsJWM3btF3BxDVeZOjRtKg/0","nick":"樊志尧","uid":317417,"userType":"user","skinText":"轻干·重耐·非色素·皱纹","skin":"轻干-重耐-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"255504","id":157013,"tags":[],"content":"请问孕妇可以用吗？怀孕七个月脸上长了很多痘痘","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-08 12:23:54","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/XCopLcwfzecPyOpHIVW0agOfckv2I1Heo210l8ceVNxX3nZED31UcyGQOM8QuYLtWJ5B6mMr3YXrBcicoZ9dpmQ/0","nick":"二当家","uid":78087,"userType":"user","skinText":"轻油·重敏·非色素·紧致","skin":"轻油-重敏-非色素-紧致"},"product":[],"subscribed":false},{"sortID":"255405","id":157004,"tags":[],"content":"怎么不好买","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-07 20:38:52","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://img.ilikelabs.com/Uploads/165/165589_0-320-320.jpg","nick":"功夫兔","uid":126122,"userType":"user","skinText":"轻油·轻耐·非色素·皱纹","skin":"轻油-轻耐-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"255280","id":156987,"tags":[],"content":"我就想知道怎么买","categoryType":"product","image":[],"likedCount":2,"commentCount":2,"createTime":"2016-11-06 16:15:03","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[{"nick":"zii","onick":"","content":"微店有链接吗？","userType":"user"},{"nick":"小舟Myra","onick":"","content":"这个是在美肤家微店卖的","userType":"user"}],"user":{"headface":"http://img.ilikelabs.com/Uploads/140/140130_0-180-180","nick":"MFJ65087","uid":371367,"userType":"user","skinText":"轻干·重敏·非色素·皱纹","skin":"轻干-重敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"253688","id":156921,"tags":[],"content":"我也想买啊，脸都快毁了，痛苦啊","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-11-03 20:24:26","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/rK4iaib8uYt1XvcPeialckOsTlo8BTCtibBEgy41W5e7F2UibicEGGTJ4JrHPUP1ia3UcU4sNGuYjzbEshYG1qBr5PbTCAQO5NQpPnn/0","nick":"无根的浮萍","uid":369611,"userType":"user","skinText":"重油·重敏·非色素·皱纹","skin":"重油-重敏-非色素-皱纹"},"product":[],"subscribed":false},{"sortID":"252685","id":156855,"tags":[],"content":"我怎么买不了","categoryType":"product","image":[],"likedCount":0,"commentCount":0,"createTime":"2016-10-31 09:33:15","categoryName":"美肤家清痘净颜精华露","categoryImage":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg","cmcid":172184,"belong_to":2,"liked":false,"tags_product":[{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}],"comments":[],"user":{"headface":"http://wx.qlogo.cn/mmopen/Q3auHgzwzM7COI8Aaqjwnol2ly9lEic1473zcQmJnWl18tZejqibMOHzBPSKefMjB0AtibYE2jiaVf0b1tP3ZqViaiatsnWwwQFSqXC8ro2A76O88/0","nick":"文","uid":364854,"userType":"user","skinText":"轻油·轻耐·非色素·紧致","skin":"轻油-轻耐-非色素-紧致"},"product":[],"subscribed":false}]
             * isUsed : false
             * review_star : 0
             * review_text :
             * howUseObject : [{"tip":"","detail":""}]
             * skinSuggestion : {"dryHeavy":true,"dryLight":true,"oilLight":true,"oilHeavy":true,"toleranceHeavy":true,"toleranceLight":true,"sensitiveLight":true,"sensitiveHeavy":true}
             * applySkinSuggestionCredit : 0
             * OilDryDesc : 干性、油性肤质长痘时均可使用，油性肤质可日常使用。
             * SensitiveDesc : 不含香精，防腐体系采用比较温和的苯氧乙醇。
             * skinMatchApplied : false
             * isOnSale : 1
             * buy_specifications : 30g
             * buy_price_original : 149.00
             * buy_price : 99.00
             * buyout_id : 100174
             * buy_product_source : 0
             * buy_refund_policy : 7
             * buy_shipping_cost : 0
             * buy_preorder : 0
             * buy_preorderText :
             * maxDiscount : 0
             * product_vote_score : 8.7
             * product_vote_count : 91
             * discussNum : 0
             * tryoutApplied : false
             * isSuitable : 0
             * recommendSkin : ["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]
             * productTryoutDate :
             * productTryoutID : 0
             * pid : 2930886
             * skinDescription :
             * effectAbstract : 从护肤品的角度探查，痤疮成因可以简化为4个字：多-堵-菌-炎。这4个成因是什么？
             * <p>
             * “多”：首先要皮脂腺过度分泌，增加皮肤油腻程度。
             * “堵”：毛囊局部角质细胞过度角化，互相粘连使毛孔开口处堵塞了。
             * “菌”：基本是三种细菌在作怪。有喜欢油脂的细菌，有喜欢氧气的细菌。最常见的痤疮丙酸杆菌：喜欢脂肪同时厌氧。所以，毛孔从外到内它都存在。
             * “炎”：皮脂与堆积的老化细胞混合，这种混合物接触空气氧化变黑就形成黑头粉刺，如果外表被角质层覆盖就形成白头粉刺。痤疮丙酸杆菌等细菌在油脂和死细胞中大量繁殖，最后造成皮肤炎症，发炎后就会形成脓包或玫瑰痤疮。
             * <p>
             * 这款美肤家祛痘精华露，摒弃了配方师习惯性采用的水杨酸、维生素A衍生物等原料，而是选用植物来源的功效成分，避免了传统的热门祛痘护理品虽然效果出众、然而痘痘源源不绝的现象。经过前期广泛的市场调查，对各种痘痘有不同程度的缓解。并且对油性肌肤具有调节油脂分泌的作用。
             * <p>
             * 功效成分排位第一位的是贯叶连翘提取物，它可以抑制弹性蛋白酶的活性，促进细胞增殖。配合其抗氧化的特性，能够增强皮肤细胞新陈代谢。
             * <p>
             * 北美金缕梅叶提取物通过抑制脂肪酶活性和游离组织胺释放，达到抗炎和抑制过敏的作用。
             * <p>
             * 锈红蔷薇籽油能够抑制脂质过氧化。同时它能够缓解红血丝和痘肌的发红肌肤。
             * <p>
             * 母菊花提取物对巨噬细胞极强的激活作用。它额外的优点是可以收缩毛孔。
             * <p>
             * 马齿苋提取物抑制脂氧合酶的活性，可以促进脂肪分解。
             * <p>
             * 综上所述，功效成分的配合运用，不仅解决了4种痤疮成因的内在源头，还在美白、保湿、抗氧化、抗衰老、抑制过敏、抗炎、缓解发红、收缩毛孔、调节油脂分泌等细节处做到了尽善尽美。
             * <p>
             * 这款精华露的载体使用了啫喱的体系，避免油分原料对油脂分泌的激发。
             * <p>
             * 不含香精。含有防腐剂苯氧乙醇。防腐体系比较温和。
             * effectDescription :
             * effectDescriptionAudio :
             * effectTips : 关于痘痘的统计数据：
             * <p>
             * 对于流行病学的调查，西方普遍认同的统计数据：80%的青少年在青春期面部都有痤疮，人们往往称之为青春痘。等到过了青春期，50%的人群痤疮没有消失。这里面的相当一部分人群，到了44岁，仍然有痤疮症状。
             * <p>
             * 北京市2005年在中学生中所做的流行病学调查显示：44.5%的青少年患有痤疮。
             * <p>
             * 皮肤科学界的观点是，痤疮是一种疾病，是“毛囊皮脂腺的疾病，而且是慢性炎症。”
             * crowdAbstract :
             * crowdDescription :
             * elementSecurityTip : {"securityTip":"","baseTip":""}
             * elementValidFuncGroup : [{"funcId":81,"els":[1240,2253]},{"funcId":65,"els":[1240,4297,1800]},{"funcId":87,"els":[1108]},{"funcId":80,"els":[1108]},{"funcId":85,"els":[1108]},{"funcId":84,"els":[4297]},{"funcId":86,"els":[2253]},{"funcId":121,"els":[2253]},{"funcId":66,"els":[2253]},{"funcId":71,"els":[2253]},{"funcId":159,"els":[2253]},{"funcId":78,"els":[1290]},{"funcId":152,"els":[1290]}]
             * uid : 121377
             * userExpert : 化妆品配方工程师
             * nick : Jane
             * headface : http://img.ilikelabs.com/Uploads/172/172255_0-140-140@200w_1x.jpg
             */

            private int id;
            private String name;
            private String brand;
            private String price;
            private String pic;
            private String createTime;
            private int status;
            private String marketPrice;
            private String location;
            private String specification;
            private String title;
            private String subTitle;
            private String shelflife;
            private int sunscreen;
            private int collectionNum;
            private int applySkinSuggestionCount;
            private int applySkinSuggestionResult;
            private String character;
            private String series;
            private String createBy;
            private int security;
            private String elementListSource;
            private String taobao_url;
            private String taobao_price;
            private int taobao_source;
            private int itemCount;
            private String brandIcon;
            private String description;
            private boolean isUsed;
            private int review_star;
            private String review_text;
            private SkinSuggestionBean skinSuggestion;
            private int applySkinSuggestionCredit;
            private String OilDryDesc;
            private String SensitiveDesc;
            private boolean skinMatchApplied;
            private int isOnSale;
            private String buy_specifications;
            private String buy_price_original;
            private String buy_price;
            private String buyout_id;
            private int buy_product_source;
            private int buy_refund_policy;
            private int buy_shipping_cost;
            private int buy_preorder;
            private String buy_preorderText;
            private int maxDiscount;
            private double product_vote_score;
            private int product_vote_count;
            private int discussNum;
            private boolean tryoutApplied;
            private int isSuitable;
            private boolean isCollection;
            private boolean isComment;
            private String productTryoutDate;
            private int productTryoutID;
            private int pid;
            private String skinDescription;
            private String effectAbstract;
            private String effectDescription;
            private String effectDescriptionAudio;
            private String effectTips;
            private String crowdAbstract;
            private String crowdDescription;
            private ElementSecurityTipBean elementSecurityTip;
            private String elementValidFuncGroup;
            private int uid;
            private String userExpert;
            private String nick;
            private String headface;
            private List<SpeAndPriceBean> speAndPrice;
            private List<String> suitableSkin;
            private List<?> unsuitedCrowd;
            private List<FuncArrBean> funcArr;
            private List<?> selectedComment;
            private List<CommunityBean> community;
            private List<HowUseObjectBean> howUseObject;
            private List<String> recommendSkin;

            public boolean isUsed() {
                return isUsed;
            }

            public void setUsed(boolean used) {
                isUsed = used;
            }

            public boolean isCollection() {
                return isCollection;
            }

            public void setCollection(boolean collection) {
                isCollection = collection;
            }

            public boolean isComment() {
                return isComment;
            }

            public void setComment(boolean comment) {
                isComment = comment;
            }

            public int getId() {
                return id;
            }

            public void setId(int id) {
                this.id = id;
            }

            public String getName() {
                return name;
            }

            public void setName(String name) {
                this.name = name;
            }

            public String getBrand() {
                return brand;
            }

            public void setBrand(String brand) {
                this.brand = brand;
            }

            public String getPrice() {
                return price;
            }

            public void setPrice(String price) {
                this.price = price;
            }

            public String getPic() {
                return pic;
            }

            public void setPic(String pic) {
                this.pic = pic;
            }

            public String getCreateTime() {
                return createTime;
            }

            public void setCreateTime(String createTime) {
                this.createTime = createTime;
            }

            public int getStatus() {
                return status;
            }

            public void setStatus(int status) {
                this.status = status;
            }

            public String getMarketPrice() {
                return marketPrice;
            }

            public void setMarketPrice(String marketPrice) {
                this.marketPrice = marketPrice;
            }

            public String getLocation() {
                return location;
            }

            public void setLocation(String location) {
                this.location = location;
            }

            public String getSpecification() {
                return specification;
            }

            public void setSpecification(String specification) {
                this.specification = specification;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getSubTitle() {
                return subTitle;
            }

            public void setSubTitle(String subTitle) {
                this.subTitle = subTitle;
            }

            public String getShelflife() {
                return shelflife;
            }

            public void setShelflife(String shelflife) {
                this.shelflife = shelflife;
            }

            public int getSunscreen() {
                return sunscreen;
            }

            public void setSunscreen(int sunscreen) {
                this.sunscreen = sunscreen;
            }

            public int getCollectionNum() {
                return collectionNum;
            }

            public void setCollectionNum(int collectionNum) {
                this.collectionNum = collectionNum;
            }

            public int getApplySkinSuggestionCount() {
                return applySkinSuggestionCount;
            }

            public void setApplySkinSuggestionCount(int applySkinSuggestionCount) {
                this.applySkinSuggestionCount = applySkinSuggestionCount;
            }

            public int getApplySkinSuggestionResult() {
                return applySkinSuggestionResult;
            }

            public void setApplySkinSuggestionResult(int applySkinSuggestionResult) {
                this.applySkinSuggestionResult = applySkinSuggestionResult;
            }

            public String getCharacter() {
                return character;
            }

            public void setCharacter(String character) {
                this.character = character;
            }

            public String getSeries() {
                return series;
            }

            public void setSeries(String series) {
                this.series = series;
            }

            public String getCreateBy() {
                return createBy;
            }

            public void setCreateBy(String createBy) {
                this.createBy = createBy;
            }

            public int getSecurity() {
                return security;
            }

            public void setSecurity(int security) {
                this.security = security;
            }

            public String getElementListSource() {
                return elementListSource;
            }

            public void setElementListSource(String elementListSource) {
                this.elementListSource = elementListSource;
            }

            public String getTaobao_url() {
                return taobao_url;
            }

            public void setTaobao_url(String taobao_url) {
                this.taobao_url = taobao_url;
            }

            public String getTaobao_price() {
                return taobao_price;
            }

            public void setTaobao_price(String taobao_price) {
                this.taobao_price = taobao_price;
            }

            public int getTaobao_source() {
                return taobao_source;
            }

            public void setTaobao_source(int taobao_source) {
                this.taobao_source = taobao_source;
            }

            public int getItemCount() {
                return itemCount;
            }

            public void setItemCount(int itemCount) {
                this.itemCount = itemCount;
            }

            public String getBrandIcon() {
                return brandIcon;
            }

            public void setBrandIcon(String brandIcon) {
                this.brandIcon = brandIcon;
            }

            public String getDescription() {
                return description;
            }

            public void setDescription(String description) {
                this.description = description;
            }

            public boolean isIsUsed() {
                return isUsed;
            }

            public void setIsUsed(boolean isUsed) {
                this.isUsed = isUsed;
            }

            public int getReview_star() {
                return review_star;
            }

            public void setReview_star(int review_star) {
                this.review_star = review_star;
            }

            public String getReview_text() {
                return review_text;
            }

            public void setReview_text(String review_text) {
                this.review_text = review_text;
            }

            public SkinSuggestionBean getSkinSuggestion() {
                return skinSuggestion;
            }

            public void setSkinSuggestion(SkinSuggestionBean skinSuggestion) {
                this.skinSuggestion = skinSuggestion;
            }

            public int getApplySkinSuggestionCredit() {
                return applySkinSuggestionCredit;
            }

            public void setApplySkinSuggestionCredit(int applySkinSuggestionCredit) {
                this.applySkinSuggestionCredit = applySkinSuggestionCredit;
            }

            public String getOilDryDesc() {
                return OilDryDesc;
            }

            public void setOilDryDesc(String OilDryDesc) {
                this.OilDryDesc = OilDryDesc;
            }

            public String getSensitiveDesc() {
                return SensitiveDesc;
            }

            public void setSensitiveDesc(String SensitiveDesc) {
                this.SensitiveDesc = SensitiveDesc;
            }

            public boolean isSkinMatchApplied() {
                return skinMatchApplied;
            }

            public void setSkinMatchApplied(boolean skinMatchApplied) {
                this.skinMatchApplied = skinMatchApplied;
            }

            public int getIsOnSale() {
                return isOnSale;
            }

            public void setIsOnSale(int isOnSale) {
                this.isOnSale = isOnSale;
            }

            public String getBuy_specifications() {
                return buy_specifications;
            }

            public void setBuy_specifications(String buy_specifications) {
                this.buy_specifications = buy_specifications;
            }

            public String getBuy_price_original() {
                return buy_price_original;
            }

            public void setBuy_price_original(String buy_price_original) {
                this.buy_price_original = buy_price_original;
            }

            public String getBuy_price() {
                return buy_price;
            }

            public void setBuy_price(String buy_price) {
                this.buy_price = buy_price;
            }

            public String getBuyout_id() {
                return buyout_id;
            }

            public void setBuyout_id(String buyout_id) {
                this.buyout_id = buyout_id;
            }

            public int getBuy_product_source() {
                return buy_product_source;
            }

            public void setBuy_product_source(int buy_product_source) {
                this.buy_product_source = buy_product_source;
            }

            public int getBuy_refund_policy() {
                return buy_refund_policy;
            }

            public void setBuy_refund_policy(int buy_refund_policy) {
                this.buy_refund_policy = buy_refund_policy;
            }

            public int getBuy_shipping_cost() {
                return buy_shipping_cost;
            }

            public void setBuy_shipping_cost(int buy_shipping_cost) {
                this.buy_shipping_cost = buy_shipping_cost;
            }

            public int getBuy_preorder() {
                return buy_preorder;
            }

            public void setBuy_preorder(int buy_preorder) {
                this.buy_preorder = buy_preorder;
            }

            public String getBuy_preorderText() {
                return buy_preorderText;
            }

            public void setBuy_preorderText(String buy_preorderText) {
                this.buy_preorderText = buy_preorderText;
            }

            public int getMaxDiscount() {
                return maxDiscount;
            }

            public void setMaxDiscount(int maxDiscount) {
                this.maxDiscount = maxDiscount;
            }

            public double getProduct_vote_score() {
                return product_vote_score;
            }

            public void setProduct_vote_score(double product_vote_score) {
                this.product_vote_score = product_vote_score;
            }

            public int getProduct_vote_count() {
                return product_vote_count;
            }

            public void setProduct_vote_count(int product_vote_count) {
                this.product_vote_count = product_vote_count;
            }

            public int getDiscussNum() {
                return discussNum;
            }

            public void setDiscussNum(int discussNum) {
                this.discussNum = discussNum;
            }

            public boolean isTryoutApplied() {
                return tryoutApplied;
            }

            public void setTryoutApplied(boolean tryoutApplied) {
                this.tryoutApplied = tryoutApplied;
            }

            public int getIsSuitable() {
                return isSuitable;
            }

            public void setIsSuitable(int isSuitable) {
                this.isSuitable = isSuitable;
            }

            public String getProductTryoutDate() {
                return productTryoutDate;
            }

            public void setProductTryoutDate(String productTryoutDate) {
                this.productTryoutDate = productTryoutDate;
            }

            public int getProductTryoutID() {
                return productTryoutID;
            }

            public void setProductTryoutID(int productTryoutID) {
                this.productTryoutID = productTryoutID;
            }

            public int getPid() {
                return pid;
            }

            public void setPid(int pid) {
                this.pid = pid;
            }

            public String getSkinDescription() {
                return skinDescription;
            }

            public void setSkinDescription(String skinDescription) {
                this.skinDescription = skinDescription;
            }

            public String getEffectAbstract() {
                return effectAbstract;
            }

            public void setEffectAbstract(String effectAbstract) {
                this.effectAbstract = effectAbstract;
            }

            public String getEffectDescription() {
                return effectDescription;
            }

            public void setEffectDescription(String effectDescription) {
                this.effectDescription = effectDescription;
            }

            public String getEffectDescriptionAudio() {
                return effectDescriptionAudio;
            }

            public void setEffectDescriptionAudio(String effectDescriptionAudio) {
                this.effectDescriptionAudio = effectDescriptionAudio;
            }

            public String getEffectTips() {
                return effectTips;
            }

            public void setEffectTips(String effectTips) {
                this.effectTips = effectTips;
            }

            public String getCrowdAbstract() {
                return crowdAbstract;
            }

            public void setCrowdAbstract(String crowdAbstract) {
                this.crowdAbstract = crowdAbstract;
            }

            public String getCrowdDescription() {
                return crowdDescription;
            }

            public void setCrowdDescription(String crowdDescription) {
                this.crowdDescription = crowdDescription;
            }

            public ElementSecurityTipBean getElementSecurityTip() {
                return elementSecurityTip;
            }

            public void setElementSecurityTip(ElementSecurityTipBean elementSecurityTip) {
                this.elementSecurityTip = elementSecurityTip;
            }

            public String getElementValidFuncGroup() {
                return elementValidFuncGroup;
            }

            public void setElementValidFuncGroup(String elementValidFuncGroup) {
                this.elementValidFuncGroup = elementValidFuncGroup;
            }

            public int getUid() {
                return uid;
            }

            public void setUid(int uid) {
                this.uid = uid;
            }

            public String getUserExpert() {
                return userExpert;
            }

            public void setUserExpert(String userExpert) {
                this.userExpert = userExpert;
            }

            public String getNick() {
                return nick;
            }

            public void setNick(String nick) {
                this.nick = nick;
            }

            public String getHeadface() {
                return headface;
            }

            public void setHeadface(String headface) {
                this.headface = headface;
            }

            public List<SpeAndPriceBean> getSpeAndPrice() {
                return speAndPrice;
            }

            public void setSpeAndPrice(List<SpeAndPriceBean> speAndPrice) {
                this.speAndPrice = speAndPrice;
            }

            public List<String> getSuitableSkin() {
                return suitableSkin;
            }

            public void setSuitableSkin(List<String> suitableSkin) {
                this.suitableSkin = suitableSkin;
            }

            public List<?> getUnsuitedCrowd() {
                return unsuitedCrowd;
            }

            public void setUnsuitedCrowd(List<?> unsuitedCrowd) {
                this.unsuitedCrowd = unsuitedCrowd;
            }

            public List<FuncArrBean> getFuncArr() {
                return funcArr;
            }

            public void setFuncArr(List<FuncArrBean> funcArr) {
                this.funcArr = funcArr;
            }

            public List<?> getSelectedComment() {
                return selectedComment;
            }

            public void setSelectedComment(List<?> selectedComment) {
                this.selectedComment = selectedComment;
            }

            public List<CommunityBean> getCommunity() {
                return community;
            }

            public void setCommunity(List<CommunityBean> community) {
                this.community = community;
            }

            public List<HowUseObjectBean> getHowUseObject() {
                return howUseObject;
            }

            public void setHowUseObject(List<HowUseObjectBean> howUseObject) {
                this.howUseObject = howUseObject;
            }

            public List<String> getRecommendSkin() {
                return recommendSkin;
            }

            public void setRecommendSkin(List<String> recommendSkin) {
                this.recommendSkin = recommendSkin;
            }

            @Override
            public String toString() {
                return "ProductBean{" +
                        "id=" + id +
                        ", name='" + name + '\'' +
                        ", brand='" + brand + '\'' +
                        ", price='" + price + '\'' +
                        ", pic='" + pic + '\'' +
                        ", createTime='" + createTime + '\'' +
                        ", status=" + status +
                        ", marketPrice='" + marketPrice + '\'' +
                        ", location='" + location + '\'' +
                        ", specification='" + specification + '\'' +
                        ", title='" + title + '\'' +
                        ", subTitle='" + subTitle + '\'' +
                        ", shelflife='" + shelflife + '\'' +
                        ", sunscreen=" + sunscreen +
                        ", collectionNum=" + collectionNum +
                        ", applySkinSuggestionCount=" + applySkinSuggestionCount +
                        ", applySkinSuggestionResult=" + applySkinSuggestionResult +
                        ", character='" + character + '\'' +
                        ", series='" + series + '\'' +
                        ", createBy='" + createBy + '\'' +
                        ", security=" + security +
                        ", elementListSource='" + elementListSource + '\'' +
                        ", taobao_url='" + taobao_url + '\'' +
                        ", taobao_price='" + taobao_price + '\'' +
                        ", taobao_source=" + taobao_source +
                        ", itemCount=" + itemCount +
                        ", brandIcon='" + brandIcon + '\'' +
                        ", description='" + description + '\'' +
                        ", isUsed=" + isUsed +
                        ", review_star=" + review_star +
                        ", review_text='" + review_text + '\'' +
                        ", skinSuggestion=" + skinSuggestion +
                        ", applySkinSuggestionCredit=" + applySkinSuggestionCredit +
                        ", OilDryDesc='" + OilDryDesc + '\'' +
                        ", SensitiveDesc='" + SensitiveDesc + '\'' +
                        ", skinMatchApplied=" + skinMatchApplied +
                        ", isOnSale=" + isOnSale +
                        ", buy_specifications='" + buy_specifications + '\'' +
                        ", buy_price_original='" + buy_price_original + '\'' +
                        ", buy_price='" + buy_price + '\'' +
                        ", buyout_id='" + buyout_id + '\'' +
                        ", buy_product_source=" + buy_product_source +
                        ", buy_refund_policy=" + buy_refund_policy +
                        ", buy_shipping_cost=" + buy_shipping_cost +
                        ", buy_preorder=" + buy_preorder +
                        ", buy_preorderText='" + buy_preorderText + '\'' +
                        ", maxDiscount=" + maxDiscount +
                        ", product_vote_score=" + product_vote_score +
                        ", product_vote_count=" + product_vote_count +
                        ", discussNum=" + discussNum +
                        ", tryoutApplied=" + tryoutApplied +
                        ", isSuitable=" + isSuitable +
                        ", productTryoutDate='" + productTryoutDate + '\'' +
                        ", productTryoutID=" + productTryoutID +
                        ", pid=" + pid +
                        ", skinDescription='" + skinDescription + '\'' +
                        ", effectAbstract='" + effectAbstract + '\'' +
                        ", effectDescription='" + effectDescription + '\'' +
                        ", effectDescriptionAudio='" + effectDescriptionAudio + '\'' +
                        ", effectTips='" + effectTips + '\'' +
                        ", crowdAbstract='" + crowdAbstract + '\'' +
                        ", crowdDescription='" + crowdDescription + '\'' +
                        ", elementSecurityTip=" + elementSecurityTip +
                        ", elementValidFuncGroup='" + elementValidFuncGroup + '\'' +
                        ", uid=" + uid +
                        ", userExpert='" + userExpert + '\'' +
                        ", nick='" + nick + '\'' +
                        ", headface='" + headface + '\'' +
                        ", speAndPrice=" + speAndPrice +
                        ", suitableSkin=" + suitableSkin +
                        ", unsuitedCrowd=" + unsuitedCrowd +
                        ", funcArr=" + funcArr +
                        ", selectedComment=" + selectedComment +
                        ", community=" + community +
                        ", howUseObject=" + howUseObject +
                        ", recommendSkin=" + recommendSkin +
                        '}';
            }

            public static class SkinSuggestionBean implements Serializable {
                @Override
                public String toString() {
                    return "SkinSuggestionBean{" +
                            "dryHeavy=" + dryHeavy +
                            ", dryLight=" + dryLight +
                            ", oilLight=" + oilLight +
                            ", oilHeavy=" + oilHeavy +
                            ", toleranceHeavy=" + toleranceHeavy +
                            ", toleranceLight=" + toleranceLight +
                            ", sensitiveLight=" + sensitiveLight +
                            ", sensitiveHeavy=" + sensitiveHeavy +
                            '}';
                }

                /**
                 * dryHeavy : true
                 * dryLight : true
                 * oilLight : true
                 * oilHeavy : true
                 * toleranceHeavy : true
                 * toleranceLight : true
                 * sensitiveLight : true
                 * sensitiveHeavy : true
                 */

                private boolean dryHeavy;
                private boolean dryLight;
                private boolean oilLight;
                private boolean oilHeavy;
                private boolean toleranceHeavy;
                private boolean toleranceLight;
                private boolean sensitiveLight;
                private boolean sensitiveHeavy;

                public boolean isDryHeavy() {
                    return dryHeavy;
                }

                public void setDryHeavy(boolean dryHeavy) {
                    this.dryHeavy = dryHeavy;
                }

                public boolean isDryLight() {
                    return dryLight;
                }

                public void setDryLight(boolean dryLight) {
                    this.dryLight = dryLight;
                }

                public boolean isOilLight() {
                    return oilLight;
                }

                public void setOilLight(boolean oilLight) {
                    this.oilLight = oilLight;
                }

                public boolean isOilHeavy() {
                    return oilHeavy;
                }

                public void setOilHeavy(boolean oilHeavy) {
                    this.oilHeavy = oilHeavy;
                }

                public boolean isToleranceHeavy() {
                    return toleranceHeavy;
                }

                public void setToleranceHeavy(boolean toleranceHeavy) {
                    this.toleranceHeavy = toleranceHeavy;
                }

                public boolean isToleranceLight() {
                    return toleranceLight;
                }

                public void setToleranceLight(boolean toleranceLight) {
                    this.toleranceLight = toleranceLight;
                }

                public boolean isSensitiveLight() {
                    return sensitiveLight;
                }

                public void setSensitiveLight(boolean sensitiveLight) {
                    this.sensitiveLight = sensitiveLight;
                }

                public boolean isSensitiveHeavy() {
                    return sensitiveHeavy;
                }

                public void setSensitiveHeavy(boolean sensitiveHeavy) {
                    this.sensitiveHeavy = sensitiveHeavy;
                }
            }

            public static class ElementSecurityTipBean implements Serializable  {
                /**
                 * securityTip :
                 * baseTip :
                 */

                private String securityTip;
                private String baseTip;

                public String getSecurityTip() {
                    return securityTip;
                }

                public void setSecurityTip(String securityTip) {
                    this.securityTip = securityTip;
                }

                public String getBaseTip() {
                    return baseTip;
                }

                public void setBaseTip(String baseTip) {
                    this.baseTip = baseTip;
                }
            }

            public static class SpeAndPriceBean  implements Serializable  {
                @Override
                public String toString() {
                    return "SpeAndPriceBean{" +
                            "spe='" + spe + '\'' +
                            ", price='" + price + '\'' +
                            ", special_price=" + special_price +
                            '}';
                }

                /**
                 * spe : 30g
                 * price : 149.00
                 * special_price : 0
                 */


                private String spe;
                private String price;
                private int special_price;

                public String getSpe() {
                    return spe;
                }

                public void setSpe(String spe) {
                    this.spe = spe;
                }

                public String getPrice() {
                    return price;
                }

                public void setPrice(String price) {
                    this.price = price;
                }

                public int getSpecial_price() {
                    return special_price;
                }

                public void setSpecial_price(int special_price) {
                    this.special_price = special_price;
                }
            }

            public static class FuncArrBean implements Serializable {
                @Override
                public String toString() {
                    return "FuncArrBean{" +
                            "id=" + id +
                            ", name='" + name + '\'' +
                            '}';
                }

                /**
                 * id : 27
                 * name : 控油
                 */

                private int id;
                private String name;

                public int getId() {
                    return id;
                }

                public void setId(int id) {
                    this.id = id;
                }

                public String getName() {
                    return name;
                }

                public void setName(String name) {
                    this.name = name;
                }
            }

            public static class CommunityBean implements Serializable{
                @Override
                public String toString() {
                    return "CommunityBean{" +
                            "sortID='" + sortID + '\'' +
                            ", id=" + id +
                            ", content='" + content + '\'' +
                            ", categoryType='" + categoryType + '\'' +
                            ", likedCount=" + likedCount +
                            ", commentCount=" + commentCount +
                            ", createTime='" + createTime + '\'' +
                            ", categoryName='" + categoryName + '\'' +
                            ", categoryImage='" + categoryImage + '\'' +
                            ", cmcid=" + cmcid +
                            ", belong_to=" + belong_to +
                            ", liked=" + liked +
                            ", user=" + user +
                            ", subscribed=" + subscribed +
                            ", tags=" + tags +
                            ", image=" + image +
                            ", tags_product=" + tags_product +
                            ", comments=" + comments +
                            ", product=" + product +
                            '}';
                }

                /**
                 * sortID : 266092
                 * id : 157735
                 * tags : []
                 * content : 一个都快用完了，然而并没卵用。。。痘痘还在长啊
                 * categoryType : product
                 * image : []
                 * likedCount : 0
                 * commentCount : 0
                 * createTime : 2016-12-20 10:11:21
                 * categoryName : 美肤家清痘净颜精华露
                 * categoryImage : http://img.ilikelabs.com//Uploads/208/208548_0-750-750@200w_1x.jpg
                 * cmcid : 172184
                 * belong_to : 2
                 * liked : false
                 * tags_product : [{"tag_id":172184,"image":"http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg","name":"美肤家清痘净颜精华露","type":1,"objectId":2930886,"suitableSkin":["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"],"recommendSkin":["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]}]
                 * comments : []
                 * user : {"headface":"http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaGiadF08Oubg1BvKONTWibjA0EHn7gHEXdujInEjIOxXFG4jAR2nErmVia2wH1kzmyQI1ib6zsQnHqk9VQsDkscy6vD/0","nick":"葛利娟","uid":386756,"userType":"user","skinText":"轻油·轻敏·非色素·皱纹","skin":"轻油-轻敏-非色素-皱纹"}
                 * product : []
                 * subscribed : false
                 */

                private String sortID;
                private int id;
                private String content;
                private String categoryType;
                private int likedCount;
                private int commentCount;
                private String createTime;
                private String categoryName;
                private String categoryImage;
                private int cmcid;
                private int belong_to;
                private boolean liked;
                private UserBean user;
                private boolean subscribed;
                private List<?> tags;
                private List<?> image;
                private List<TagsProductBean> tags_product;
                private List<?> comments;
                private List<?> product;

                public String getSortID() {
                    return sortID;
                }

                public void setSortID(String sortID) {
                    this.sortID = sortID;
                }

                public int getId() {
                    return id;
                }

                public void setId(int id) {
                    this.id = id;
                }

                public String getContent() {
                    return content;
                }

                public void setContent(String content) {
                    this.content = content;
                }

                public String getCategoryType() {
                    return categoryType;
                }

                public void setCategoryType(String categoryType) {
                    this.categoryType = categoryType;
                }

                public int getLikedCount() {
                    return likedCount;
                }

                public void setLikedCount(int likedCount) {
                    this.likedCount = likedCount;
                }

                public int getCommentCount() {
                    return commentCount;
                }

                public void setCommentCount(int commentCount) {
                    this.commentCount = commentCount;
                }

                public String getCreateTime() {
                    return createTime;
                }

                public void setCreateTime(String createTime) {
                    this.createTime = createTime;
                }

                public String getCategoryName() {
                    return categoryName;
                }

                public void setCategoryName(String categoryName) {
                    this.categoryName = categoryName;
                }

                public String getCategoryImage() {
                    return categoryImage;
                }

                public void setCategoryImage(String categoryImage) {
                    this.categoryImage = categoryImage;
                }

                public int getCmcid() {
                    return cmcid;
                }

                public void setCmcid(int cmcid) {
                    this.cmcid = cmcid;
                }

                public int getBelong_to() {
                    return belong_to;
                }

                public void setBelong_to(int belong_to) {
                    this.belong_to = belong_to;
                }

                public boolean isLiked() {
                    return liked;
                }

                public void setLiked(boolean liked) {
                    this.liked = liked;
                }

                public UserBean getUser() {
                    return user;
                }

                public void setUser(UserBean user) {
                    this.user = user;
                }

                public boolean isSubscribed() {
                    return subscribed;
                }

                public void setSubscribed(boolean subscribed) {
                    this.subscribed = subscribed;
                }

                public List<?> getTags() {
                    return tags;
                }

                public void setTags(List<?> tags) {
                    this.tags = tags;
                }

                public List<?> getImage() {
                    return image;
                }

                public void setImage(List<?> image) {
                    this.image = image;
                }

                public List<TagsProductBean> getTags_product() {
                    return tags_product;
                }

                public void setTags_product(List<TagsProductBean> tags_product) {
                    this.tags_product = tags_product;
                }

                public List<?> getComments() {
                    return comments;
                }

                public void setComments(List<?> comments) {
                    this.comments = comments;
                }

                public List<?> getProduct() {
                    return product;
                }

                public void setProduct(List<?> product) {
                    this.product = product;
                }

                public static class UserBean implements Serializable{
                    /**
                     * headface : http://wx.qlogo.cn/mmopen/PiaOWQNiaicJiaGiadF08Oubg1BvKONTWibjA0EHn7gHEXdujInEjIOxXFG4jAR2nErmVia2wH1kzmyQI1ib6zsQnHqk9VQsDkscy6vD/0
                     * nick : 葛利娟
                     * uid : 386756
                     * userType : user
                     * skinText : 轻油·轻敏·非色素·皱纹
                     * skin : 轻油-轻敏-非色素-皱纹
                     */

                    private String headface;
                    private String nick;
                    private int uid;
                    private String userType;
                    private String skinText;
                    private String skin;

                    public String getHeadface() {
                        return headface;
                    }

                    public void setHeadface(String headface) {
                        this.headface = headface;
                    }

                    public String getNick() {
                        return nick;
                    }

                    public void setNick(String nick) {
                        this.nick = nick;
                    }

                    public int getUid() {
                        return uid;
                    }

                    public void setUid(int uid) {
                        this.uid = uid;
                    }

                    public String getUserType() {
                        return userType;
                    }

                    public void setUserType(String userType) {
                        this.userType = userType;
                    }

                    public String getSkinText() {
                        return skinText;
                    }

                    public void setSkinText(String skinText) {
                        this.skinText = skinText;
                    }

                    public String getSkin() {
                        return skin;
                    }

                    public void setSkin(String skin) {
                        this.skin = skin;
                    }
                }

                public static class TagsProductBean implements Serializable{
                    /**
                     * tag_id : 172184
                     * image : http://img.ilikelabs.com//Uploads/208/208548_0-750-750@120w_1x.jpg
                     * name : 美肤家清痘净颜精华露
                     * type : 1
                     * objectId : 2930886
                     * suitableSkin : ["0000","0003","0030","0033","0100","0103","0130","0133","0200","0203","0230","0233","0300","0303","0330","0333","1000","1003","1030","1033","1100","1103","1130","1133","1200","1203","1230","1233","1300","1303","1330","1333","2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]
                     * recommendSkin : ["2000","2003","2030","2033","2100","2103","2130","2133","2200","2203","2230","2233","2300","2303","2330","2333","3000","3003","3030","3033","3100","3103","3130","3133","3200","3203","3230","3233","3300","3303","3330","3333"]
                     */

                    private int tag_id;
                    private String image;
                    private String name;
                    private int type;
                    private int objectId;
                    private List<String> suitableSkin;
                    private List<String> recommendSkin;

                    public int getTag_id() {
                        return tag_id;
                    }

                    public void setTag_id(int tag_id) {
                        this.tag_id = tag_id;
                    }

                    public String getImage() {
                        return image;
                    }

                    public void setImage(String image) {
                        this.image = image;
                    }

                    public String getName() {
                        return name;
                    }

                    public void setName(String name) {
                        this.name = name;
                    }

                    public int getType() {
                        return type;
                    }

                    public void setType(int type) {
                        this.type = type;
                    }

                    public int getObjectId() {
                        return objectId;
                    }

                    public void setObjectId(int objectId) {
                        this.objectId = objectId;
                    }

                    public List<String> getSuitableSkin() {
                        return suitableSkin;
                    }

                    public void setSuitableSkin(List<String> suitableSkin) {
                        this.suitableSkin = suitableSkin;
                    }

                    public List<String> getRecommendSkin() {
                        return recommendSkin;
                    }

                    public void setRecommendSkin(List<String> recommendSkin) {
                        this.recommendSkin = recommendSkin;
                    }
                }
            }

            public static class HowUseObjectBean  implements Serializable {
                @Override
                public String toString() {
                    return "HowUseObjectBean{" +
                            "tip='" + tip + '\'' +
                            ", detail='" + detail + '\'' +
                            '}';
                }

                /**
                 * tip :
                 * detail :
                 */

                private String tip;
                private String detail;

                public String getTip() {
                    return tip;
                }

                public void setTip(String tip) {
                    this.tip = tip;
                }

                public String getDetail() {
                    return detail;
                }

                public void setDetail(String detail) {
                    this.detail = detail;
                }
            }
        }
    }
}
